{"class_name": "Functional", "config": {"name": "model_1163", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_150"}, "name": "input_150", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_150", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_811_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_811_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_43_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_43_insert", "inbound_nodes": [[["conv2d_811_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_337_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_337_insert_1", "inbound_nodes": [[["dropout_43_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_813_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_813_insert", "inbound_nodes": [[["batch_normalization_337_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_275_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_275_insert", "inbound_nodes": [[["conv2d_813_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_277_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_277_insert", "inbound_nodes": [[["max_pooling2d_275_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_17_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_17_insert_1", "inbound_nodes": [[["max_pooling2d_277_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_45_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_45_insert", "inbound_nodes": [[["flatten_17_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_252", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_252", "inbound_nodes": [[["dropout_45_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_253", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_253", "inbound_nodes": [[["custom_expand_layer_252", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_117", "trainable": true, "dtype": "float32", "padding": [[7, 7], [8, 8], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_117", "inbound_nodes": [[["custom_expand_layer_253", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_90", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 5]]}, "name": "custom_crop_layer_90", "inbound_nodes": [[["custom_pad_layer_117", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_339_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_339_insert", "inbound_nodes": [[["custom_crop_layer_90", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_118", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_118", "inbound_nodes": [[["batch_normalization_339_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_91", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 1], [0, 0]]}, "name": "custom_crop_layer_91", "inbound_nodes": [[["custom_pad_layer_118", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_341_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_341_insert", "inbound_nodes": [[["custom_crop_layer_91", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_92", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [3, 4], [3, 4]]}, "name": "custom_crop_layer_92", "inbound_nodes": [[["batch_normalization_341_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_815_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_815_insert", "inbound_nodes": [[["custom_crop_layer_92", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_119", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_119", "inbound_nodes": [[["conv2d_815_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_279_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_279_insert", "inbound_nodes": [[["custom_pad_layer_119", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_17_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_17_insert_2", "inbound_nodes": [[["batch_normalization_339_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_337_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_337_insert_2", "inbound_nodes": [[["max_pooling2d_277_insert", 0, 0, {}]]]}], "input_layers": [["input_150", 0, 0]], "output_layers": [["max_pooling2d_279_insert", 0, 0], ["flatten_17_insert_2", 0, 0], ["batch_normalization_337_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}