{"class_name": "Functional", "config": {"name": "model_1217", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_158"}, "name": "input_158", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["input_158", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_199_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_199_insert", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_823_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_823_insert", "inbound_nodes": [[["average_pooling2d_199_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_63_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_63_insert", "inbound_nodes": [[["conv2d_823_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_825_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_825_insert", "inbound_nodes": [[["zero_padding2d_63_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_343_insert_1_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_343_insert_1_1", "inbound_nodes": [[["conv2d_825_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_281_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_281_insert_1", "inbound_nodes": [[["batch_normalization_343_insert_1_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_257_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_257_insert", "inbound_nodes": [[["max_pooling2d_281_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_266_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_266_insert", "inbound_nodes": [[["global_average_pooling2d_257_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_267_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_267_insert", "inbound_nodes": [[["custom_expand_layer_266_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_827_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_827_insert", "inbound_nodes": [[["custom_expand_layer_267_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_123", "trainable": true, "dtype": "float32", "padding": [[3, 4], [6, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_123", "inbound_nodes": [[["conv2d_827_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_95", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_95", "inbound_nodes": [[["custom_pad_layer_123", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_345_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_345_insert_merge1", "inbound_nodes": [[["custom_crop_layer_95", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_8_copy_ML", "inbound_nodes": [[["batch_normalization_345_insert_merge1", 0, 0, {}], ["custom_crop_layer_95", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_124", "trainable": true, "dtype": "float32", "padding": [[5, 6], [2, 2], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_124", "inbound_nodes": [[["concatenate_8_copy_ML", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_201_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_201_insert_1", "inbound_nodes": [[["custom_pad_layer_124", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_125", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_125", "inbound_nodes": [[["average_pooling2d_201_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_829_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_829_insert", "inbound_nodes": [[["custom_pad_layer_125", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_126", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_126", "inbound_nodes": [[["conv2d_829_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_831_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_831_insert", "inbound_nodes": [[["custom_pad_layer_126", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_127", "trainable": true, "dtype": "float32", "padding": [[6, 7], [4, 4], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_127", "inbound_nodes": [[["conv2d_831_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_203_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_203_insert", "inbound_nodes": [[["custom_pad_layer_127", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_128", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_128", "inbound_nodes": [[["average_pooling2d_203_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_96", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 4]]}, "name": "custom_crop_layer_96", "inbound_nodes": [[["custom_pad_layer_128", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_347_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_347_insert", "inbound_nodes": [[["custom_crop_layer_96", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_129", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_129", "inbound_nodes": [[["batch_normalization_347_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_97", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [0, 0]]}, "name": "custom_crop_layer_97", "inbound_nodes": [[["custom_pad_layer_129", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_349_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_349_insert", "inbound_nodes": [[["custom_crop_layer_97", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_130", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_130", "inbound_nodes": [[["batch_normalization_349_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_281_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_281_insert_2", "inbound_nodes": [[["zero_padding2d_63_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_98", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 0], [0, 0]]}, "name": "custom_crop_layer_98", "inbound_nodes": [[["custom_pad_layer_130", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_343_insert_1_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_343_insert_1_2", "inbound_nodes": [[["max_pooling2d_281_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_351_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_351_insert", "inbound_nodes": [[["custom_crop_layer_98", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_10", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_10", "inbound_nodes": [[["max_pooling2d_281_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_343_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_343_insert_2", "inbound_nodes": [[["average_pooling2d_201_insert_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_201_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_201_insert_2", "inbound_nodes": [[["conv2d_831_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_11", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_11", "inbound_nodes": [[["batch_normalization_343_insert_1_2", 0, 0, {}]]]}], "input_layers": [["input_158", 0, 0]], "output_layers": [["batch_normalization_351_insert", 0, 0], ["cropping2d_10", 0, 0], ["batch_normalization_343_insert_2", 0, 0], ["average_pooling2d_201_insert_2", 0, 0], ["cropping2d_11", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}