{"class_name": "Functional", "config": {"name": "model_1582", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_211"}, "name": "input_211", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_211", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_441_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_441_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_275_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_275_insert_1", "inbound_nodes": [[["batch_normalization_441_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1141_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1141_insert", "inbound_nodes": [[["average_pooling2d_275_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1143_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1143_insert", "inbound_nodes": [[["conv2d_1141_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1145_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1145_insert", "inbound_nodes": [[["conv2d_1143_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_377_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_377_insert", "inbound_nodes": [[["conv2d_1145_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1147_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1147_insert", "inbound_nodes": [[["max_pooling2d_377_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_363_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_363_insert", "inbound_nodes": [[["conv2d_1147_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_354_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_354_insert", "inbound_nodes": [[["global_average_pooling2d_363_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_355_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_355_insert", "inbound_nodes": [[["custom_expand_layer_354_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1149_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1149_insert", "inbound_nodes": [[["custom_expand_layer_355_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1151_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1151_insert", "inbound_nodes": [[["conv2d_1149_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1153_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1153_insert", "inbound_nodes": [[["conv2d_1151_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1155_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1155_insert", "inbound_nodes": [[["conv2d_1153_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1157_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1157_insert", "inbound_nodes": [[["conv2d_1155_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_137", "trainable": true, "dtype": "float32", "padding": [[8, 8], [3, 4], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_137", "inbound_nodes": [[["conv2d_1157_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_379_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_379_insert", "inbound_nodes": [[["custom_pad_layer_137", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_138", "trainable": true, "dtype": "float32", "padding": [[3, 3], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_138", "inbound_nodes": [[["max_pooling2d_379_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_102", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 4]]}, "name": "custom_crop_layer_102", "inbound_nodes": [[["custom_pad_layer_138", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_277_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_277_insert", "inbound_nodes": [[["custom_crop_layer_102", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_139", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_139", "inbound_nodes": [[["average_pooling2d_277_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_103", "trainable": true, "dtype": "float32", "cropping": [[3, 4], [0, 0], [0, 0]]}, "name": "custom_crop_layer_103", "inbound_nodes": [[["custom_pad_layer_139", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_381_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_381_insert", "inbound_nodes": [[["custom_crop_layer_103", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_140", "trainable": true, "dtype": "float32", "padding": [[3, 3], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_140", "inbound_nodes": [[["max_pooling2d_381_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_104", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [5, 6]]}, "name": "custom_crop_layer_104", "inbound_nodes": [[["custom_pad_layer_140", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_383_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_383_insert", "inbound_nodes": [[["custom_crop_layer_104", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_141", "trainable": true, "dtype": "float32", "padding": [[0, 1], [3, 3], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_141", "inbound_nodes": [[["max_pooling2d_383_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_279_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_279_insert", "inbound_nodes": [[["custom_pad_layer_141", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_142", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_142", "inbound_nodes": [[["average_pooling2d_279_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_105", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_105", "inbound_nodes": [[["custom_pad_layer_142", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_281_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_281_insert", "inbound_nodes": [[["custom_crop_layer_105", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_143", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_143", "inbound_nodes": [[["average_pooling2d_281_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_106", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 1], [0, 0]]}, "name": "custom_crop_layer_106", "inbound_nodes": [[["custom_pad_layer_143", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_283_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_283_insert", "inbound_nodes": [[["custom_crop_layer_106", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_144", "trainable": true, "dtype": "float32", "padding": [[2, 2], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_144", "inbound_nodes": [[["average_pooling2d_283_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_107", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_107", "inbound_nodes": [[["custom_pad_layer_144", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_443_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_443_insert_merge1", "inbound_nodes": [[["custom_crop_layer_107", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_10_copy_ML", "inbound_nodes": [[["batch_normalization_443_insert_merge1", 0, 0, {}], ["custom_crop_layer_107", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_145", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_145", "inbound_nodes": [[["concatenate_10_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_108", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [4, 5]]}, "name": "custom_crop_layer_108", "inbound_nodes": [[["custom_pad_layer_145", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_445_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_445_insert", "inbound_nodes": [[["custom_crop_layer_108", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_146", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_146", "inbound_nodes": [[["batch_normalization_445_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_447_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_447_insert", "inbound_nodes": [[["custom_pad_layer_146", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_147", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_147", "inbound_nodes": [[["batch_normalization_447_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_109", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [0, 0], [3, 3]]}, "name": "custom_crop_layer_109", "inbound_nodes": [[["custom_pad_layer_147", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_275_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_275_insert_2", "inbound_nodes": [[["max_pooling2d_377_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_449_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_449_insert", "inbound_nodes": [[["custom_crop_layer_109", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_15", "trainable": true, "dtype": "float32", "cropping": [[31, 31], [31, 31]], "data_format": "channels_last"}, "name": "cropping2d_15", "inbound_nodes": [[["average_pooling2d_275_insert_2", 0, 0, {}]]]}], "input_layers": [["input_211", 0, 0]], "output_layers": [["batch_normalization_449_insert", 0, 0], ["cropping2d_15", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}