{"class_name": "Functional", "config": {"name": "model_1797", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_233"}, "name": "input_233", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_1", "inbound_nodes": [[["input_233", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_511_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_511_insert", "inbound_nodes": [[["Conv1_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_119_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_119_insert", "inbound_nodes": [[["batch_normalization_511_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_121_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_121_insert_1", "inbound_nodes": [[["depthwise_conv2d_119_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_95_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_95_insert", "inbound_nodes": [[["depthwise_conv2d_121_insert_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_405_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_405_insert_1", "inbound_nodes": [[["zero_padding2d_95_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_396_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_396_insert", "inbound_nodes": [[["global_average_pooling2d_405_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_397_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_397_insert", "inbound_nodes": [[["custom_expand_layer_396_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1239_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1239_insert", "inbound_nodes": [[["custom_expand_layer_397_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_83_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_83_insert", "inbound_nodes": [[["conv2d_1239_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1241_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1241_insert", "inbound_nodes": [[["re_lu_83_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_180", "trainable": true, "dtype": "float32", "padding": [[4, 5], [6, 6], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_180", "inbound_nodes": [[["conv2d_1241_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_85_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_85_insert", "inbound_nodes": [[["custom_pad_layer_180", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_133", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [1, 2], [3, 4]]}, "name": "custom_crop_layer_133", "inbound_nodes": [[["re_lu_85_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_87_insert_1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_87_insert_1", "inbound_nodes": [[["custom_crop_layer_133", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_181", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 5], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_181", "inbound_nodes": [[["re_lu_87_insert_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_89_insert_merge1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_89_insert_merge1", "inbound_nodes": [[["custom_pad_layer_181", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_9_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_9_copy_ML", "inbound_nodes": [[["re_lu_89_insert_merge1", 0, 0, {}], ["custom_pad_layer_181", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_134", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [6, 6], [4, 5]]}, "name": "custom_crop_layer_134", "inbound_nodes": [[["add_9_copy_ML", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_97_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_97_insert_1", "inbound_nodes": [[["custom_crop_layer_134", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_182", "trainable": true, "dtype": "float32", "padding": [[6, 6], [1, 1], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_182", "inbound_nodes": [[["zero_padding2d_97_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1243_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1243_insert", "inbound_nodes": [[["custom_pad_layer_182", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_183", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_183", "inbound_nodes": [[["conv2d_1243_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_135", "trainable": true, "dtype": "float32", "cropping": [[6, 7], [0, 0], [0, 0]]}, "name": "custom_crop_layer_135", "inbound_nodes": [[["custom_pad_layer_183", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_99_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_99_insert", "inbound_nodes": [[["custom_crop_layer_135", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_184", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_184", "inbound_nodes": [[["zero_padding2d_99_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_136", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 0]]}, "name": "custom_crop_layer_136", "inbound_nodes": [[["custom_pad_layer_184", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_101_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_101_insert", "inbound_nodes": [[["custom_crop_layer_136", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_185", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_185", "inbound_nodes": [[["zero_padding2d_101_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_137", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [6, 7]]}, "name": "custom_crop_layer_137", "inbound_nodes": [[["custom_pad_layer_185", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_513_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_513_insert", "inbound_nodes": [[["custom_crop_layer_137", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_186", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 3], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_186", "inbound_nodes": [[["batch_normalization_513_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_123_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_123_insert_1", "inbound_nodes": [[["custom_pad_layer_186", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_187", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_187", "inbound_nodes": [[["depthwise_conv2d_123_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_138", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [1, 1], [0, 0]]}, "name": "custom_crop_layer_138", "inbound_nodes": [[["custom_pad_layer_187", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_91_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_91_insert", "inbound_nodes": [[["custom_crop_layer_138", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_188", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_188", "inbound_nodes": [[["re_lu_91_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_139", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_139", "inbound_nodes": [[["custom_pad_layer_188", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1245_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1245_insert", "inbound_nodes": [[["custom_crop_layer_139", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_189", "trainable": true, "dtype": "float32", "padding": [[2, 3], [5, 5], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_189", "inbound_nodes": [[["conv2d_1245_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_125_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_125_insert", "inbound_nodes": [[["custom_pad_layer_189", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_190", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_190", "inbound_nodes": [[["depthwise_conv2d_125_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_140", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [0, 0]]}, "name": "custom_crop_layer_140", "inbound_nodes": [[["custom_pad_layer_190", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_515_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_515_insert_1", "inbound_nodes": [[["custom_crop_layer_140", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_191", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_191", "inbound_nodes": [[["batch_normalization_515_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_141", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_141", "inbound_nodes": [[["custom_pad_layer_191", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_517_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_517_insert", "inbound_nodes": [[["custom_crop_layer_141", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_192", "trainable": true, "dtype": "float32", "padding": [[0, 0], [6, 7], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_192", "inbound_nodes": [[["batch_normalization_517_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_142", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 0], [0, 0]]}, "name": "custom_crop_layer_142", "inbound_nodes": [[["custom_pad_layer_192", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_519_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_519_insert", "inbound_nodes": [[["custom_crop_layer_142", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_193", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_193", "inbound_nodes": [[["batch_normalization_519_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_143", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 5], [2, 3]]}, "name": "custom_crop_layer_143", "inbound_nodes": [[["custom_pad_layer_193", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_515_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_515_insert_2", "inbound_nodes": [[["depthwise_conv2d_119_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_87_insert_2", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_87_insert_2", "inbound_nodes": [[["batch_normalization_513_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_127_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_127_insert", "inbound_nodes": [[["custom_crop_layer_143", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_123_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_123_insert_2", "inbound_nodes": [[["re_lu_91_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_405_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_405_insert_2", "inbound_nodes": [[["re_lu_87_insert_1", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_19", "trainable": true, "dtype": "float32", "cropping": [[22, 22], [22, 22]], "data_format": "channels_last"}, "name": "cropping2d_19", "inbound_nodes": [[["batch_normalization_515_insert_2", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_121_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_121_insert_2", "inbound_nodes": [[["zero_padding2d_101_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv1_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_2", "inbound_nodes": [[["batch_normalization_513_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_97_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_97_insert_2", "inbound_nodes": [[["re_lu_87_insert_2", 0, 0, {}]]]}], "input_layers": [["input_233", 0, 0]], "output_layers": [["depthwise_conv2d_127_insert", 0, 0], ["depthwise_conv2d_123_insert_2", 0, 0], ["global_average_pooling2d_405_insert_2", 0, 0], ["cropping2d_19", 0, 0], ["depthwise_conv2d_121_insert_2", 0, 0], ["Conv1_2", 0, 0], ["zero_padding2d_97_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}