{"class_name": "Functional", "config": {"name": "model_4620", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_582"}, "name": "input_582", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_582", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_229_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_229_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1061_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1061_insert_1", "inbound_nodes": [[["dropout_229_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1063_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1063_insert", "inbound_nodes": [[["max_pooling2d_1061_insert_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_81_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_81_insert_1", "inbound_nodes": [[["max_pooling2d_1063_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_998_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_998_insert", "inbound_nodes": [[["flatten_81_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_999_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_999_insert", "inbound_nodes": [[["custom_expand_layer_998_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3001_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3001_insert", "inbound_nodes": [[["custom_expand_layer_999_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3003_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3003_insert", "inbound_nodes": [[["conv2d_3001_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1365_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1365_insert", "inbound_nodes": [[["conv2d_3003_insert", 0, 0, {}]]]}, {"class_name": "CustomDropDimLayer", "config": {"name": "custom_drop_dim_layer_6", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_drop_dim_layer_6", "inbound_nodes": [[["batch_normalization_1365_insert", 0, 0, {}]]]}, {"class_name": "CustomDropDimLayer", "config": {"name": "custom_drop_dim_layer_7", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_drop_dim_layer_7", "inbound_nodes": [[["custom_drop_dim_layer_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_231_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_231_insert", "inbound_nodes": [[["custom_drop_dim_layer_7", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1000", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1000", "inbound_nodes": [[["dropout_231_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1001", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1001", "inbound_nodes": [[["custom_expand_layer_1000", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_624", "trainable": true, "dtype": "float32", "padding": [[4, 5], [4, 5], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_624", "inbound_nodes": [[["custom_expand_layer_1001", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1367_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1367_insert_1", "inbound_nodes": [[["custom_pad_layer_624", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_625", "trainable": true, "dtype": "float32", "padding": [[3, 4], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_625", "inbound_nodes": [[["batch_normalization_1367_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1065_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1065_insert", "inbound_nodes": [[["custom_pad_layer_625", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_626", "trainable": true, "dtype": "float32", "padding": [[2, 3], [4, 4], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_626", "inbound_nodes": [[["max_pooling2d_1065_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3005_insert_1", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3005_insert_1", "inbound_nodes": [[["custom_pad_layer_626", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_627", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_627", "inbound_nodes": [[["conv2d_3005_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_471", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_471", "inbound_nodes": [[["custom_pad_layer_627", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1367_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1367_insert_2", "inbound_nodes": [[["max_pooling2d_1065_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1369_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1369_insert", "inbound_nodes": [[["custom_crop_layer_471", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_81_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_81_insert_2", "inbound_nodes": [[["batch_normalization_1367_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3005_insert_2", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3005_insert_2", "inbound_nodes": [[["batch_normalization_1367_insert_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1061_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1061_insert_2", "inbound_nodes": [[["conv2d_3005_insert_1", 0, 0, {}]]]}], "input_layers": [["input_582", 0, 0]], "output_layers": [["batch_normalization_1369_insert", 0, 0], ["flatten_81_insert_2", 0, 0], ["conv2d_3005_insert_2", 0, 0], ["max_pooling2d_1061_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}