{"class_name": "Functional", "config": {"name": "model_4697", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_592"}, "name": "input_592", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["input_592", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1075_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1075_insert", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_755_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_755_insert", "inbound_nodes": [[["max_pooling2d_1075_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3031_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3031_insert", "inbound_nodes": [[["average_pooling2d_755_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1379_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1379_insert", "inbound_nodes": [[["conv2d_3031_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3033_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3033_insert", "inbound_nodes": [[["batch_normalization_1379_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_275_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_275_insert", "inbound_nodes": [[["conv2d_3033_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3035_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3035_insert", "inbound_nodes": [[["zero_padding2d_275_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_969_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_969_insert", "inbound_nodes": [[["conv2d_3035_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1018", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1018", "inbound_nodes": [[["global_average_pooling2d_969_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1019", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1019", "inbound_nodes": [[["custom_expand_layer_1018", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_631", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_631", "inbound_nodes": [[["custom_expand_layer_1019", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3037_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3037_insert", "inbound_nodes": [[["custom_pad_layer_631", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_632", "trainable": true, "dtype": "float32", "padding": [[2, 3], [1, 1], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_632", "inbound_nodes": [[["conv2d_3037_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_757_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_757_insert_1", "inbound_nodes": [[["custom_pad_layer_632", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_633", "trainable": true, "dtype": "float32", "padding": [[6, 7], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_633", "inbound_nodes": [[["average_pooling2d_757_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_474", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_474", "inbound_nodes": [[["custom_pad_layer_633", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_759_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_759_insert", "inbound_nodes": [[["custom_crop_layer_474", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_634", "trainable": true, "dtype": "float32", "padding": [[4, 4], [6, 7], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_634", "inbound_nodes": [[["average_pooling2d_759_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3039_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3039_insert", "inbound_nodes": [[["custom_pad_layer_634", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_635", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_635", "inbound_nodes": [[["conv2d_3039_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_475", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [1, 2], [0, 0]]}, "name": "custom_crop_layer_475", "inbound_nodes": [[["custom_pad_layer_635", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1381_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1381_insert", "inbound_nodes": [[["custom_crop_layer_475", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_636", "trainable": true, "dtype": "float32", "padding": [[5, 5], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_636", "inbound_nodes": [[["batch_normalization_1381_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_476", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_476", "inbound_nodes": [[["custom_pad_layer_636", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1383_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1383_insert_1", "inbound_nodes": [[["custom_crop_layer_476", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_637", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_637", "inbound_nodes": [[["batch_normalization_1383_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_477", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [4, 5], [0, 0]]}, "name": "custom_crop_layer_477", "inbound_nodes": [[["custom_pad_layer_637", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1385_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1385_insert", "inbound_nodes": [[["custom_crop_layer_477", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_638", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_638", "inbound_nodes": [[["batch_normalization_1385_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1387_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1387_insert_merge1", "inbound_nodes": [[["custom_pad_layer_638", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1383_insert_2_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1383_insert_2_2", "inbound_nodes": [[["max_pooling2d_1075_insert", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_33_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_33_copy_ML", "inbound_nodes": [[["batch_normalization_1387_insert_merge1", 0, 0, {}], ["custom_pad_layer_638", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1383_insert_2_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1383_insert_2_1", "inbound_nodes": [[["average_pooling2d_759_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_757_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_757_insert_2", "inbound_nodes": [[["conv2d_3035_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_64", "trainable": true, "dtype": "float32", "cropping": [[52, 52], [52, 52]], "data_format": "channels_last"}, "name": "cropping2d_64", "inbound_nodes": [[["batch_normalization_1383_insert_2_2", 0, 0, {}]]]}], "input_layers": [["input_592", 0, 0]], "output_layers": [["concatenate_33_copy_ML", 0, 0], ["batch_normalization_1383_insert_2_1", 0, 0], ["average_pooling2d_757_insert_2", 0, 0], ["cropping2d_64", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}