{"class_name": "Functional", "config": {"name": "model_5110", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_645"}, "name": "input_645", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_645", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3425_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3425_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_285_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_285_insert", "inbound_nodes": [[["conv2d_3425_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1181_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1181_insert", "inbound_nodes": [[["zero_padding2d_285_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3427_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3427_insert", "inbound_nodes": [[["max_pooling2d_1181_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3429_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3429_insert", "inbound_nodes": [[["conv2d_3427_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3431_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3431_insert", "inbound_nodes": [[["conv2d_3429_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1485_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1485_insert", "inbound_nodes": [[["conv2d_3431_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1075_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1075_insert", "inbound_nodes": [[["batch_normalization_1485_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1114", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1114", "inbound_nodes": [[["global_average_pooling2d_1075_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1115", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1115", "inbound_nodes": [[["custom_expand_layer_1114", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_655", "trainable": true, "dtype": "float32", "padding": [[4, 4], [5, 5], [7, 8]], "constant_values": 2}, "name": "custom_pad_layer_655", "inbound_nodes": [[["custom_expand_layer_1115", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3433_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3433_insert", "inbound_nodes": [[["custom_pad_layer_655", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_656", "trainable": true, "dtype": "float32", "padding": [[2, 2], [5, 5], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_656", "inbound_nodes": [[["conv2d_3433_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1487_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1487_insert", "inbound_nodes": [[["custom_pad_layer_656", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_657", "trainable": true, "dtype": "float32", "padding": [[5, 6], [0, 0], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_657", "inbound_nodes": [[["batch_normalization_1487_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_492", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_492", "inbound_nodes": [[["custom_pad_layer_657", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1489_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1489_insert", "inbound_nodes": [[["custom_crop_layer_492", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_658", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_658", "inbound_nodes": [[["batch_normalization_1489_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_493", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [0, 0], [1, 2]]}, "name": "custom_crop_layer_493", "inbound_nodes": [[["custom_pad_layer_658", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1491_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1491_insert_merge1", "inbound_nodes": [[["custom_crop_layer_493", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_35_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_35_copy_ML", "inbound_nodes": [[["batch_normalization_1491_insert_merge1", 0, 0, {}], ["custom_crop_layer_493", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_659", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_659", "inbound_nodes": [[["add_35_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_494", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_494", "inbound_nodes": [[["custom_pad_layer_659", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1493_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1493_insert", "inbound_nodes": [[["custom_crop_layer_494", 0, 0, {}]]]}], "input_layers": [["input_645", 0, 0]], "output_layers": [["batch_normalization_1493_insert", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}