{"class_name": "Functional", "config": {"name": "model_2709", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_345"}, "name": "input_345", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_345", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_601_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_601_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1769_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1769_insert", "inbound_nodes": [[["max_pooling2d_601_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_435_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_435_insert", "inbound_nodes": [[["conv2d_1769_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1771_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1771_insert", "inbound_nodes": [[["average_pooling2d_435_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1773_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1773_insert", "inbound_nodes": [[["conv2d_1771_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1775_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1775_insert", "inbound_nodes": [[["conv2d_1773_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1777_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1777_insert", "inbound_nodes": [[["conv2d_1775_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_785_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_785_insert", "inbound_nodes": [[["conv2d_1777_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1779_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1779_insert", "inbound_nodes": [[["batch_normalization_785_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1781_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1781_insert", "inbound_nodes": [[["conv2d_1779_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_563_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_563_insert", "inbound_nodes": [[["conv2d_1781_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_592_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_592_insert", "inbound_nodes": [[["global_average_pooling2d_563_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_593_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_593_insert", "inbound_nodes": [[["custom_expand_layer_592_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1783_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1783_insert", "inbound_nodes": [[["custom_expand_layer_593_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1785_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1785_insert", "inbound_nodes": [[["conv2d_1783_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_347", "trainable": true, "dtype": "float32", "padding": [[9, 9], [2, 3], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_347", "inbound_nodes": [[["conv2d_1785_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_603_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_603_insert", "inbound_nodes": [[["custom_pad_layer_347", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_348", "trainable": true, "dtype": "float32", "padding": [[5, 5], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_348", "inbound_nodes": [[["max_pooling2d_603_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_255", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 5]]}, "name": "custom_crop_layer_255", "inbound_nodes": [[["custom_pad_layer_348", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_437_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_437_insert", "inbound_nodes": [[["custom_crop_layer_255", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_349", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_349", "inbound_nodes": [[["average_pooling2d_437_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_256", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_256", "inbound_nodes": [[["custom_pad_layer_349", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_605_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_605_insert", "inbound_nodes": [[["custom_crop_layer_256", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_350", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_350", "inbound_nodes": [[["max_pooling2d_605_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_257", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_257", "inbound_nodes": [[["custom_pad_layer_350", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_439_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_439_insert", "inbound_nodes": [[["custom_crop_layer_257", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_351", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_351", "inbound_nodes": [[["average_pooling2d_439_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_258", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_258", "inbound_nodes": [[["custom_pad_layer_351", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_441_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_441_insert_1", "inbound_nodes": [[["custom_crop_layer_258", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_352", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_352", "inbound_nodes": [[["average_pooling2d_441_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_607_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_607_insert", "inbound_nodes": [[["custom_pad_layer_352", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_353", "trainable": true, "dtype": "float32", "padding": [[2, 3], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_353", "inbound_nodes": [[["max_pooling2d_607_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_259", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 3]]}, "name": "custom_crop_layer_259", "inbound_nodes": [[["custom_pad_layer_353", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_443_insert_merge1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_443_insert_merge1", "inbound_nodes": [[["custom_crop_layer_259", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_19_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_19_copy_ML", "inbound_nodes": [[["average_pooling2d_443_insert_merge1", 0, 0, {}], ["custom_crop_layer_259", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_354", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_354", "inbound_nodes": [[["concatenate_19_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_260", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 1]]}, "name": "custom_crop_layer_260", "inbound_nodes": [[["custom_pad_layer_354", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_787_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_787_insert", "inbound_nodes": [[["custom_crop_layer_260", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_355", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 3], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_355", "inbound_nodes": [[["batch_normalization_787_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_261", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 0], [0, 0]]}, "name": "custom_crop_layer_261", "inbound_nodes": [[["custom_pad_layer_355", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_789_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_789_insert", "inbound_nodes": [[["custom_crop_layer_261", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_356", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_356", "inbound_nodes": [[["batch_normalization_789_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_262", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_262", "inbound_nodes": [[["custom_pad_layer_356", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_791_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_791_insert", "inbound_nodes": [[["custom_crop_layer_262", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_357", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_357", "inbound_nodes": [[["batch_normalization_791_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_263", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_263", "inbound_nodes": [[["custom_pad_layer_357", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_793_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_793_insert", "inbound_nodes": [[["custom_crop_layer_263", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_441_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_441_insert_2", "inbound_nodes": [[["max_pooling2d_607_insert", 0, 0, {}]]]}], "input_layers": [["input_345", 0, 0]], "output_layers": [["batch_normalization_793_insert", 0, 0], ["average_pooling2d_441_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}