{"class_name": "Functional", "config": {"name": "model_2667", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_341"}, "name": "input_341", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_341", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_773_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_773_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_587_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_587_insert", "inbound_nodes": [[["batch_normalization_773_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1739_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1739_insert", "inbound_nodes": [[["max_pooling2d_587_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_427_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_427_insert_1", "inbound_nodes": [[["conv2d_1739_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1741_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1741_insert", "inbound_nodes": [[["average_pooling2d_427_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1743_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1743_insert", "inbound_nodes": [[["conv2d_1741_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_555_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_555_insert", "inbound_nodes": [[["conv2d_1743_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_584_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_584_insert", "inbound_nodes": [[["global_average_pooling2d_555_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_585_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_585_insert", "inbound_nodes": [[["custom_expand_layer_584_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1745_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1745_insert", "inbound_nodes": [[["custom_expand_layer_585_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1747_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1747_insert", "inbound_nodes": [[["conv2d_1745_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1749_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1749_insert", "inbound_nodes": [[["conv2d_1747_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1751_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1751_insert", "inbound_nodes": [[["conv2d_1749_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1753_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1753_insert", "inbound_nodes": [[["conv2d_1751_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1755_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1755_insert", "inbound_nodes": [[["conv2d_1753_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1757_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1757_insert", "inbound_nodes": [[["conv2d_1755_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_341", "trainable": true, "dtype": "float32", "padding": [[5, 6], [8, 8], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_341", "inbound_nodes": [[["conv2d_1757_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_775_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_775_insert", "inbound_nodes": [[["custom_pad_layer_341", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_342", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_342", "inbound_nodes": [[["batch_normalization_775_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_251", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [1, 1], [0, 0]]}, "name": "custom_crop_layer_251", "inbound_nodes": [[["custom_pad_layer_342", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_777_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_777_insert", "inbound_nodes": [[["custom_crop_layer_251", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_343", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_343", "inbound_nodes": [[["batch_normalization_777_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_252", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [1, 2]]}, "name": "custom_crop_layer_252", "inbound_nodes": [[["custom_pad_layer_343", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_779_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_779_insert_merge1", "inbound_nodes": [[["custom_crop_layer_252", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_18_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_18_copy_ML", "inbound_nodes": [[["batch_normalization_779_insert_merge1", 0, 0, {}], ["custom_crop_layer_252", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_253", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [1, 1], [3, 3]]}, "name": "custom_crop_layer_253", "inbound_nodes": [[["concatenate_18_copy_ML", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_589_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_589_insert", "inbound_nodes": [[["custom_crop_layer_253", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_344", "trainable": true, "dtype": "float32", "padding": [[7, 7], [2, 3], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_344", "inbound_nodes": [[["max_pooling2d_589_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_781_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_781_insert", "inbound_nodes": [[["custom_pad_layer_344", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_345", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_345", "inbound_nodes": [[["batch_normalization_781_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_254", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [1, 1]]}, "name": "custom_crop_layer_254", "inbound_nodes": [[["custom_pad_layer_345", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_591_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_591_insert", "inbound_nodes": [[["custom_crop_layer_254", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_346", "trainable": true, "dtype": "float32", "padding": [[3, 4], [4, 5], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_346", "inbound_nodes": [[["max_pooling2d_591_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_593_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_593_insert", "inbound_nodes": [[["custom_pad_layer_346", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_427_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_427_insert_2", "inbound_nodes": [[["max_pooling2d_591_insert", 0, 0, {}]]]}], "input_layers": [["input_341", 0, 0]], "output_layers": [["max_pooling2d_593_insert", 0, 0], ["average_pooling2d_427_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}