{"class_name": "Functional", "config": {"name": "model_2616", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_337"}, "name": "input_337", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9_1", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9_1", "inbound_nodes": [[["input_337", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1727_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1727_insert", "inbound_nodes": [[["conv2d_9_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_135_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_135_insert", "inbound_nodes": [[["conv2d_1727_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_417_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_417_insert", "inbound_nodes": [[["dropout_135_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_51_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_51_insert", "inbound_nodes": [[["average_pooling2d_417_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_137_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_137_insert", "inbound_nodes": [[["flatten_51_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_578", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_578", "inbound_nodes": [[["dropout_137_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_579", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_579", "inbound_nodes": [[["custom_expand_layer_578", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_333", "trainable": true, "dtype": "float32", "padding": [[4, 5], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_333", "inbound_nodes": [[["custom_expand_layer_579", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_246", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [281, 281]]}, "name": "custom_crop_layer_246", "inbound_nodes": [[["custom_pad_layer_333", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_419_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_419_insert_1", "inbound_nodes": [[["custom_crop_layer_246", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_419_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_419_insert_2", "inbound_nodes": [[["conv2d_9_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9_2", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9_2", "inbound_nodes": [[["average_pooling2d_417_insert", 0, 0, {}]]]}], "input_layers": [["input_337", 0, 0]], "output_layers": [["average_pooling2d_419_insert_1", 0, 0], ["average_pooling2d_419_insert_2", 0, 0], ["conv2d_9_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}