{"class_name": "Functional", "config": {"name": "model_2839", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_361"}, "name": "input_361", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_361", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_169_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_169_insert", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_171_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_171_insert", "inbound_nodes": [[["depthwise_conv2d_169_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_121_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_121_insert", "inbound_nodes": [[["depthwise_conv2d_171_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_153_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_153_insert", "inbound_nodes": [[["re_lu_121_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_593_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_593_insert_1", "inbound_nodes": [[["zero_padding2d_153_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_614_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_614_insert", "inbound_nodes": [[["global_average_pooling2d_593_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_615_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_615_insert", "inbound_nodes": [[["custom_expand_layer_614_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1833_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1833_insert", "inbound_nodes": [[["custom_expand_layer_615_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_831_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_831_insert", "inbound_nodes": [[["conv2d_1833_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1835_insert_1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1835_insert_1", "inbound_nodes": [[["batch_normalization_831_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_375", "trainable": true, "dtype": "float32", "padding": [[7, 7], [8, 8], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_375", "inbound_nodes": [[["conv2d_1835_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1837_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1837_insert", "inbound_nodes": [[["custom_pad_layer_375", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_376", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [7, 7]], "constant_values": 2}, "name": "custom_pad_layer_376", "inbound_nodes": [[["conv2d_1837_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_279", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [2, 3], [0, 0]]}, "name": "custom_crop_layer_279", "inbound_nodes": [[["custom_pad_layer_376", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_173_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_173_insert", "inbound_nodes": [[["custom_crop_layer_279", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_377", "trainable": true, "dtype": "float32", "padding": [[4, 5], [3, 4], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_377", "inbound_nodes": [[["depthwise_conv2d_173_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_833_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_833_insert_1", "inbound_nodes": [[["custom_pad_layer_377", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_378", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_378", "inbound_nodes": [[["batch_normalization_833_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_280", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [0, 0]]}, "name": "custom_crop_layer_280", "inbound_nodes": [[["custom_pad_layer_378", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1839_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1839_insert", "inbound_nodes": [[["custom_crop_layer_280", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_379", "trainable": true, "dtype": "float32", "padding": [[5, 6], [0, 1], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_379", "inbound_nodes": [[["conv2d_1839_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_155_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_155_insert", "inbound_nodes": [[["custom_pad_layer_379", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_281", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [3, 3]]}, "name": "custom_crop_layer_281", "inbound_nodes": [[["zero_padding2d_155_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_175_insert_1_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_175_insert_1_1", "inbound_nodes": [[["custom_crop_layer_281", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_380", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_380", "inbound_nodes": [[["depthwise_conv2d_175_insert_1_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_282", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [1, 2]]}, "name": "custom_crop_layer_282", "inbound_nodes": [[["custom_pad_layer_380", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_177_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_177_insert", "inbound_nodes": [[["custom_crop_layer_282", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_381", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_381", "inbound_nodes": [[["depthwise_conv2d_177_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_283", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [5, 6], [0, 0]]}, "name": "custom_crop_layer_283", "inbound_nodes": [[["custom_pad_layer_381", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_835_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_835_insert", "inbound_nodes": [[["custom_crop_layer_283", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_382", "trainable": true, "dtype": "float32", "padding": [[0, 0], [6, 7], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_382", "inbound_nodes": [[["batch_normalization_835_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_284", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 1]]}, "name": "custom_crop_layer_284", "inbound_nodes": [[["custom_pad_layer_382", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_157_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_157_insert", "inbound_nodes": [[["custom_crop_layer_284", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_383", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_383", "inbound_nodes": [[["zero_padding2d_157_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_285", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [0, 0]]}, "name": "custom_crop_layer_285", "inbound_nodes": [[["custom_pad_layer_383", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_123_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_123_insert", "inbound_nodes": [[["custom_crop_layer_285", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_286", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [6, 7]]}, "name": "custom_crop_layer_286", "inbound_nodes": [[["re_lu_123_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_159_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_159_insert", "inbound_nodes": [[["custom_crop_layer_286", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_384", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_384", "inbound_nodes": [[["zero_padding2d_159_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_287", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [5, 6], [0, 0]]}, "name": "custom_crop_layer_287", "inbound_nodes": [[["custom_pad_layer_384", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_125_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_125_insert", "inbound_nodes": [[["custom_crop_layer_287", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_385", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_385", "inbound_nodes": [[["re_lu_125_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_288", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [0, 0], [0, 1]]}, "name": "custom_crop_layer_288", "inbound_nodes": [[["custom_pad_layer_385", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_837_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_837_insert_merge1", "inbound_nodes": [[["custom_crop_layer_288", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_20_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_20_copy_ML", "inbound_nodes": [[["batch_normalization_837_insert_merge1", 0, 0, {}], ["custom_crop_layer_288", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_386", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_386", "inbound_nodes": [[["add_20_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_289", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [5, 5], [0, 0]]}, "name": "custom_crop_layer_289", "inbound_nodes": [[["custom_pad_layer_386", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_839_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_839_insert", "inbound_nodes": [[["custom_crop_layer_289", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_387", "trainable": true, "dtype": "float32", "padding": [[3, 3], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_387", "inbound_nodes": [[["batch_normalization_839_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_290", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_290", "inbound_nodes": [[["custom_pad_layer_387", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_127_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_127_insert", "inbound_nodes": [[["custom_crop_layer_290", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_291", "trainable": true, "dtype": "float32", "cropping": [[3, 4], [2, 3], [1, 1]]}, "name": "custom_crop_layer_291", "inbound_nodes": [[["re_lu_127_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1835_insert_2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1835_insert_2", "inbound_nodes": [[["re_lu_121_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_129_insert_2", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_129_insert_2", "inbound_nodes": [[["batch_normalization_831_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_833_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_833_insert_2", "inbound_nodes": [[["depthwise_conv2d_169_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_129_insert_1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_129_insert_1", "inbound_nodes": [[["custom_crop_layer_291", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_39", "trainable": true, "dtype": "float32", "cropping": [[22, 22], [22, 22]], "data_format": "channels_last"}, "name": "cropping2d_39", "inbound_nodes": [[["conv2d_1835_insert_2", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_175_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_175_insert_2", "inbound_nodes": [[["re_lu_129_insert_2", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_175_insert_1_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_175_insert_1_2", "inbound_nodes": [[["zero_padding2d_159_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_40", "trainable": true, "dtype": "float32", "cropping": [[22, 22], [22, 22]], "data_format": "channels_last"}, "name": "cropping2d_40", "inbound_nodes": [[["batch_normalization_833_insert_2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_593_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_593_insert_2", "inbound_nodes": [[["re_lu_127_insert", 0, 0, {}]]]}], "input_layers": [["input_361", 0, 0]], "output_layers": [["re_lu_129_insert_1", 0, 0], ["cropping2d_39", 0, 0], ["depthwise_conv2d_175_insert_2", 0, 0], ["depthwise_conv2d_175_insert_1_2", 0, 0], ["cropping2d_40", 0, 0], ["global_average_pooling2d_593_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}