{"class_name": "Functional", "config": {"name": "model_2788", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_355"}, "name": "input_355", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_355", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_73_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_73_insert", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1821_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1821_insert", "inbound_nodes": [[["separable_conv2d_73_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_625_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_625_insert", "inbound_nodes": [[["conv2d_1821_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_817_insert_1_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_817_insert_1_1", "inbound_nodes": [[["max_pooling2d_625_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_583_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_583_insert", "inbound_nodes": [[["batch_normalization_817_insert_1_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_608_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_608_insert", "inbound_nodes": [[["global_average_pooling2d_583_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_609_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_609_insert", "inbound_nodes": [[["custom_expand_layer_608_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1823_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1823_insert", "inbound_nodes": [[["custom_expand_layer_609_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_362", "trainable": true, "dtype": "float32", "padding": [[8, 9], [4, 4], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_362", "inbound_nodes": [[["conv2d_1823_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_819_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_819_insert", "inbound_nodes": [[["custom_pad_layer_362", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_363", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_363", "inbound_nodes": [[["batch_normalization_819_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_268", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_268", "inbound_nodes": [[["custom_pad_layer_363", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1825_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1825_insert", "inbound_nodes": [[["custom_crop_layer_268", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_364", "trainable": true, "dtype": "float32", "padding": [[3, 4], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_364", "inbound_nodes": [[["conv2d_1825_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_269", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_269", "inbound_nodes": [[["custom_pad_layer_364", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_75_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 39}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_75_insert", "inbound_nodes": [[["custom_crop_layer_269", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_365", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_365", "inbound_nodes": [[["separable_conv2d_75_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_270", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [0, 0]]}, "name": "custom_crop_layer_270", "inbound_nodes": [[["custom_pad_layer_365", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1827_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1827_insert", "inbound_nodes": [[["custom_crop_layer_270", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_366", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_366", "inbound_nodes": [[["conv2d_1827_insert", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_77_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 50}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_77_insert", "inbound_nodes": [[["custom_pad_layer_366", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_367", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 3], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_367", "inbound_nodes": [[["separable_conv2d_77_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_271", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 0], [0, 0]]}, "name": "custom_crop_layer_271", "inbound_nodes": [[["custom_pad_layer_367", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_627_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_627_insert_1", "inbound_nodes": [[["custom_crop_layer_271", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_368", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_368", "inbound_nodes": [[["max_pooling2d_627_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_272", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_272", "inbound_nodes": [[["custom_pad_layer_368", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_629_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_629_insert", "inbound_nodes": [[["custom_crop_layer_272", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_369", "trainable": true, "dtype": "float32", "padding": [[6, 6], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_369", "inbound_nodes": [[["max_pooling2d_629_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_273", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_273", "inbound_nodes": [[["custom_pad_layer_369", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_821_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_821_insert", "inbound_nodes": [[["custom_crop_layer_273", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_370_merge1", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_370_merge1", "inbound_nodes": [[["batch_normalization_821_insert", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_18_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_18_copy_ML", "inbound_nodes": [[["custom_pad_layer_370_merge1", 0, 0, {}], ["custom_pad_layer_365", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_274", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [1, 1], [0, 0]]}, "name": "custom_crop_layer_274", "inbound_nodes": [[["add_18_copy_ML", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_79_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 71}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_79_insert", "inbound_nodes": [[["custom_crop_layer_274", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_371", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_371", "inbound_nodes": [[["separable_conv2d_79_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_275", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [0, 0]]}, "name": "custom_crop_layer_275", "inbound_nodes": [[["custom_pad_layer_371", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_823_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_823_insert", "inbound_nodes": [[["custom_crop_layer_275", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_372", "trainable": true, "dtype": "float32", "padding": [[0, 0], [7, 7], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_372", "inbound_nodes": [[["batch_normalization_823_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_276", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [0, 0]]}, "name": "custom_crop_layer_276", "inbound_nodes": [[["custom_pad_layer_372", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_825_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_825_insert", "inbound_nodes": [[["custom_crop_layer_276", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_373", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_373", "inbound_nodes": [[["batch_normalization_825_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_277", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [5, 6], [1, 1]]}, "name": "custom_crop_layer_277", "inbound_nodes": [[["custom_pad_layer_373", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_631_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_631_insert", "inbound_nodes": [[["custom_crop_layer_277", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_374", "trainable": true, "dtype": "float32", "padding": [[0, 1], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_374", "inbound_nodes": [[["max_pooling2d_631_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_278", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 5]]}, "name": "custom_crop_layer_278", "inbound_nodes": [[["custom_pad_layer_374", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_81_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 95}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_81_insert", "inbound_nodes": [[["custom_crop_layer_278", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_817_insert_1_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_817_insert_1_2", "inbound_nodes": [[["conv2d_1821_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_817_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_817_insert_2", "inbound_nodes": [[["separable_conv2d_81_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_627_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_627_insert_2", "inbound_nodes": [[["batch_normalization_825_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_38", "trainable": true, "dtype": "float32", "cropping": [[68, 68], [68, 68]], "data_format": "channels_last"}, "name": "cropping2d_38", "inbound_nodes": [[["batch_normalization_817_insert_1_2", 0, 0, {}]]]}], "input_layers": [["input_355", 0, 0]], "output_layers": [["batch_normalization_817_insert_2", 0, 0], ["max_pooling2d_627_insert_2", 0, 0], ["cropping2d_38", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}