{"class_name": "Functional", "config": {"name": "model_3965", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_510"}, "name": "input_510", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_510", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1155_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1155_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2645_insert_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2645_insert_1", "inbound_nodes": [[["batch_normalization_1155_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_195_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_195_insert", "inbound_nodes": [[["conv2d_2645_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2647_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2647_insert", "inbound_nodes": [[["dropout_195_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_901_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_901_insert", "inbound_nodes": [[["conv2d_2647_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_903_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_903_insert", "inbound_nodes": [[["max_pooling2d_901_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_74_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_74_insert_1", "inbound_nodes": [[["max_pooling2d_903_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_197_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_197_insert", "inbound_nodes": [[["flatten_74_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_866", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_866", "inbound_nodes": [[["dropout_197_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_867", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_867", "inbound_nodes": [[["custom_expand_layer_866", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_508", "trainable": true, "dtype": "float32", "padding": [[4, 4], [6, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_508", "inbound_nodes": [[["custom_expand_layer_867", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_378", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [7, 7]]}, "name": "custom_crop_layer_378", "inbound_nodes": [[["custom_pad_layer_508", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2649_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2649_insert", "inbound_nodes": [[["custom_crop_layer_378", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_509", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_509", "inbound_nodes": [[["conv2d_2649_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_379", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_379", "inbound_nodes": [[["custom_pad_layer_509", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_905_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_905_insert", "inbound_nodes": [[["custom_crop_layer_379", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_510", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_510", "inbound_nodes": [[["max_pooling2d_905_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_380", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [1, 2]]}, "name": "custom_crop_layer_380", "inbound_nodes": [[["custom_pad_layer_510", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1157_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1157_insert_1", "inbound_nodes": [[["custom_crop_layer_380", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_511", "trainable": true, "dtype": "float32", "padding": [[3, 4], [1, 2], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_511", "inbound_nodes": [[["batch_normalization_1157_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1159_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1159_insert", "inbound_nodes": [[["custom_pad_layer_511", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2645_insert_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2645_insert_2", "inbound_nodes": [[["conv2d_2649_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_74_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_74_insert_2", "inbound_nodes": [[["batch_normalization_1159_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1157_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1157_insert_2", "inbound_nodes": [[["max_pooling2d_905_insert", 0, 0, {}]]]}], "input_layers": [["input_510", 0, 0]], "output_layers": [["conv2d_2645_insert_2", 0, 0], ["flatten_74_insert_2", 0, 0], ["batch_normalization_1157_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}