{"class_name": "Functional", "config": {"name": "model_4023", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_517"}, "name": "input_517", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["input_517", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2659_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2659_insert", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_643_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_643_insert", "inbound_nodes": [[["conv2d_2659_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_223_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_223_insert", "inbound_nodes": [[["average_pooling2d_643_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_909_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_909_insert", "inbound_nodes": [[["zero_padding2d_223_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1167_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1167_insert", "inbound_nodes": [[["max_pooling2d_909_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2661_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2661_insert", "inbound_nodes": [[["batch_normalization_1167_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_847_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_847_insert", "inbound_nodes": [[["conv2d_2661_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_881_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_881_insert", "inbound_nodes": [[["global_average_pooling2d_847_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_882_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_882_insert", "inbound_nodes": [[["custom_expand_layer_881_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2663_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2663_insert", "inbound_nodes": [[["custom_expand_layer_882_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_514", "trainable": true, "dtype": "float32", "padding": [[3, 3], [4, 5], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_514", "inbound_nodes": [[["conv2d_2663_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2665_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2665_insert", "inbound_nodes": [[["custom_pad_layer_514", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_515", "trainable": true, "dtype": "float32", "padding": [[6, 6], [4, 4], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_515", "inbound_nodes": [[["conv2d_2665_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_645_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_645_insert", "inbound_nodes": [[["custom_pad_layer_515", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_516", "trainable": true, "dtype": "float32", "padding": [[4, 5], [4, 5], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_516", "inbound_nodes": [[["average_pooling2d_645_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_647_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_647_insert", "inbound_nodes": [[["custom_pad_layer_516", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_517", "trainable": true, "dtype": "float32", "padding": [[1, 2], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_517", "inbound_nodes": [[["average_pooling2d_647_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_382", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [6, 6]]}, "name": "custom_crop_layer_382", "inbound_nodes": [[["custom_pad_layer_517", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2667_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2667_insert", "inbound_nodes": [[["custom_crop_layer_382", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_518", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_518", "inbound_nodes": [[["conv2d_2667_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_383", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 5], [0, 0]]}, "name": "custom_crop_layer_383", "inbound_nodes": [[["custom_pad_layer_518", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1169_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1169_insert_1", "inbound_nodes": [[["custom_crop_layer_383", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_519", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_519", "inbound_nodes": [[["batch_normalization_1169_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_384", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 0], [0, 0]]}, "name": "custom_crop_layer_384", "inbound_nodes": [[["custom_pad_layer_519", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1171_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1171_insert_1", "inbound_nodes": [[["custom_crop_layer_384", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_520", "trainable": true, "dtype": "float32", "padding": [[1, 1], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_520", "inbound_nodes": [[["batch_normalization_1171_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_385", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_385", "inbound_nodes": [[["custom_pad_layer_520", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1173_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1173_insert", "inbound_nodes": [[["custom_crop_layer_385", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_521", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_521", "inbound_nodes": [[["batch_normalization_1173_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_386", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [2, 2], [0, 0]]}, "name": "custom_crop_layer_386", "inbound_nodes": [[["custom_pad_layer_521", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1175_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1175_insert_merge1", "inbound_nodes": [[["custom_crop_layer_386", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1171_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1171_insert_2", "inbound_nodes": [[["conv2d_2661_insert", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_27_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_27_copy_ML", "inbound_nodes": [[["batch_normalization_1175_insert_merge1", 0, 0, {}], ["custom_crop_layer_386", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_50", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_50", "inbound_nodes": [[["batch_normalization_1171_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1169_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1169_insert_2", "inbound_nodes": [[["average_pooling2d_647_insert", 0, 0, {}]]]}], "input_layers": [["input_517", 0, 0]], "output_layers": [["concatenate_27_copy_ML", 0, 0], ["cropping2d_50", 0, 0], ["batch_normalization_1169_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}