{"class_name": "Functional", "config": {"name": "model_4224", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_545"}, "name": "input_545", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_545", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2801_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2801_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1235_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1235_insert", "inbound_nodes": [[["conv2d_2801_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_975_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_975_insert_1", "inbound_nodes": [[["batch_normalization_1235_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_229_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_229_insert", "inbound_nodes": [[["max_pooling2d_975_insert_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_903_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_903_insert", "inbound_nodes": [[["zero_padding2d_229_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_929_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_929_insert", "inbound_nodes": [[["global_average_pooling2d_903_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_930_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_930_insert", "inbound_nodes": [[["custom_expand_layer_929_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2803_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2803_insert", "inbound_nodes": [[["custom_expand_layer_930_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2805_insert_1", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2805_insert_1", "inbound_nodes": [[["conv2d_2803_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2807_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2807_insert", "inbound_nodes": [[["conv2d_2805_insert_1", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_537", "trainable": true, "dtype": "float32", "padding": [[3, 3], [9, 9], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_537", "inbound_nodes": [[["conv2d_2807_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1237_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1237_insert", "inbound_nodes": [[["custom_pad_layer_537", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_538", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_538", "inbound_nodes": [[["batch_normalization_1237_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_399", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 5], [0, 1]]}, "name": "custom_crop_layer_399", "inbound_nodes": [[["custom_pad_layer_538", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1239_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1239_insert", "inbound_nodes": [[["custom_crop_layer_399", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_539", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_539", "inbound_nodes": [[["batch_normalization_1239_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_400", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [4, 5]]}, "name": "custom_crop_layer_400", "inbound_nodes": [[["custom_pad_layer_539", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2809_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2809_insert", "inbound_nodes": [[["custom_crop_layer_400", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_540", "trainable": true, "dtype": "float32", "padding": [[2, 2], [5, 6], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_540", "inbound_nodes": [[["conv2d_2809_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1241_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1241_insert", "inbound_nodes": [[["custom_pad_layer_540", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_401", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [4, 4], [1, 1]]}, "name": "custom_crop_layer_401", "inbound_nodes": [[["batch_normalization_1241_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1243_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1243_insert_merge1", "inbound_nodes": [[["custom_crop_layer_401", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2805_insert_2", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2805_insert_2", "inbound_nodes": [[["max_pooling2d_975_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_975_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_975_insert_2", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_28_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_28_copy_ML", "inbound_nodes": [[["batch_normalization_1243_insert_merge1", 0, 0, {}], ["custom_crop_layer_401", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_55", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_55", "inbound_nodes": [[["conv2d_2805_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_56", "trainable": true, "dtype": "float32", "cropping": [[52, 52], [52, 52]], "data_format": "channels_last"}, "name": "cropping2d_56", "inbound_nodes": [[["max_pooling2d_975_insert_2", 0, 0, {}]]]}], "input_layers": [["input_545", 0, 0]], "output_layers": [["add_28_copy_ML", 0, 0], ["cropping2d_55", 0, 0], ["cropping2d_56", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}