{"class_name": "Functional", "config": {"name": "model_8515", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1069"}, "name": "input_1069", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1_1", "inbound_nodes": [[["input_1069", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5763_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5763_insert", "inbound_nodes": [[["conv2d_1_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2001_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2001_insert", "inbound_nodes": [[["conv2d_5763_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2003_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2003_insert", "inbound_nodes": [[["max_pooling2d_2001_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2521_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2521_insert", "inbound_nodes": [[["max_pooling2d_2003_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_134_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_134_insert", "inbound_nodes": [[["batch_normalization_2521_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_393_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_393_insert", "inbound_nodes": [[["flatten_134_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1805_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1805_insert", "inbound_nodes": [[["dropout_393_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1806_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1806_insert", "inbound_nodes": [[["custom_expand_layer_1805_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5765_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5765_insert", "inbound_nodes": [[["custom_expand_layer_1806_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1131", "trainable": true, "dtype": "float32", "padding": [[8, 8], [3, 3], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_1131", "inbound_nodes": [[["conv2d_5765_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2005_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2005_insert", "inbound_nodes": [[["custom_pad_layer_1131", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1132", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1132", "inbound_nodes": [[["max_pooling2d_2005_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_837", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_837", "inbound_nodes": [[["custom_pad_layer_1132", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2523_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2523_insert", "inbound_nodes": [[["custom_crop_layer_837", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1133", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_1133", "inbound_nodes": [[["batch_normalization_2523_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_838", "trainable": true, "dtype": "float32", "cropping": [[6, 7], [1, 2], [0, 0]]}, "name": "custom_crop_layer_838", "inbound_nodes": [[["custom_pad_layer_1133", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5767_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5767_insert", "inbound_nodes": [[["custom_crop_layer_838", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1134", "trainable": true, "dtype": "float32", "padding": [[0, 1], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1134", "inbound_nodes": [[["conv2d_5767_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_839", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_839", "inbound_nodes": [[["custom_pad_layer_1134", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2525_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2525_insert", "inbound_nodes": [[["custom_crop_layer_839", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1_2", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1_2", "inbound_nodes": [[["batch_normalization_2523_insert", 0, 0, {}]]]}], "input_layers": [["input_1069", 0, 0]], "output_layers": [["batch_normalization_2525_insert", 0, 0], ["conv2d_1_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}