{"class_name": "Functional", "config": {"name": "model_8753", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1096"}, "name": "input_1096", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1096", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2593_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2593_insert", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_241_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_241_insert", "inbound_nodes": [[["batch_normalization_2593_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2053_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2053_insert", "inbound_nodes": [[["separable_conv2d_241_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5929_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5929_insert", "inbound_nodes": [[["max_pooling2d_2053_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5931_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5931_insert", "inbound_nodes": [[["conv2d_5929_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1845_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1845_insert", "inbound_nodes": [[["conv2d_5931_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1851", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1851", "inbound_nodes": [[["global_average_pooling2d_1845_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1852", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1852", "inbound_nodes": [[["custom_expand_layer_1851", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1166", "trainable": true, "dtype": "float32", "padding": [[9, 9], [8, 8], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_1166", "inbound_nodes": [[["custom_expand_layer_1852", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2595_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2595_insert", "inbound_nodes": [[["custom_pad_layer_1166", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1167", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_1167", "inbound_nodes": [[["batch_normalization_2595_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_860", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [6, 6], [0, 0]]}, "name": "custom_crop_layer_860", "inbound_nodes": [[["custom_pad_layer_1167", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2055_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2055_insert", "inbound_nodes": [[["custom_crop_layer_860", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1168", "trainable": true, "dtype": "float32", "padding": [[1, 2], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1168", "inbound_nodes": [[["max_pooling2d_2055_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_861", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 1]]}, "name": "custom_crop_layer_861", "inbound_nodes": [[["custom_pad_layer_1168", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2597_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2597_insert", "inbound_nodes": [[["custom_crop_layer_861", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1169", "trainable": true, "dtype": "float32", "padding": [[1, 2], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1169", "inbound_nodes": [[["batch_normalization_2597_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_862", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_862", "inbound_nodes": [[["custom_pad_layer_1169", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5933_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5933_insert", "inbound_nodes": [[["custom_crop_layer_862", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1170", "trainable": true, "dtype": "float32", "padding": [[5, 6], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1170", "inbound_nodes": [[["conv2d_5933_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2057_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2057_insert", "inbound_nodes": [[["custom_pad_layer_1170", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1171", "trainable": true, "dtype": "float32", "padding": [[2, 3], [5, 5], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_1171", "inbound_nodes": [[["max_pooling2d_2057_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2599_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2599_insert", "inbound_nodes": [[["custom_pad_layer_1171", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_863", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [5, 6], [1, 1]]}, "name": "custom_crop_layer_863", "inbound_nodes": [[["batch_normalization_2599_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2601_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2601_insert_1", "inbound_nodes": [[["custom_crop_layer_863", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1172", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1172", "inbound_nodes": [[["batch_normalization_2601_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_864", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [1, 2]]}, "name": "custom_crop_layer_864", "inbound_nodes": [[["custom_pad_layer_1172", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2059_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2059_insert_1", "inbound_nodes": [[["custom_crop_layer_864", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1173", "trainable": true, "dtype": "float32", "padding": [[5, 6], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1173", "inbound_nodes": [[["max_pooling2d_2059_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_865", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_865", "inbound_nodes": [[["custom_pad_layer_1173", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5935_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5935_insert", "inbound_nodes": [[["custom_crop_layer_865", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1174", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_1174", "inbound_nodes": [[["conv2d_5935_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_866", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_866", "inbound_nodes": [[["custom_pad_layer_1174", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_243_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 71}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_243_insert", "inbound_nodes": [[["custom_crop_layer_866", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1175", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_1175", "inbound_nodes": [[["separable_conv2d_243_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_867", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [0, 0]]}, "name": "custom_crop_layer_867", "inbound_nodes": [[["custom_pad_layer_1175", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_245_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 78}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_245_insert", "inbound_nodes": [[["custom_crop_layer_867", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1176", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 4], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_1176", "inbound_nodes": [[["separable_conv2d_245_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_868", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 0], [0, 0]]}, "name": "custom_crop_layer_868", "inbound_nodes": [[["custom_pad_layer_1176", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_247_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 85}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_247_insert", "inbound_nodes": [[["custom_crop_layer_868", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1177", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_1177", "inbound_nodes": [[["separable_conv2d_247_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_869", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 1], [0, 0]]}, "name": "custom_crop_layer_869", "inbound_nodes": [[["custom_pad_layer_1177", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2601_insert_2_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2601_insert_2_merge1", "inbound_nodes": [[["separable_conv2d_247_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2059_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2059_insert_2", "inbound_nodes": [[["batch_normalization_2593_insert", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_249_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 98}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_249_insert", "inbound_nodes": [[["custom_crop_layer_869", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_69_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_69_copy_ML", "inbound_nodes": [[["batch_normalization_2601_insert_2_merge1", 0, 0, {}], ["separable_conv2d_247_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_123", "trainable": true, "dtype": "float32", "cropping": [[32, 32], [32, 32]], "data_format": "channels_last"}, "name": "cropping2d_123", "inbound_nodes": [[["max_pooling2d_2059_insert_2", 0, 0, {}]]]}], "input_layers": [["input_1096", 0, 0]], "output_layers": [["separable_conv2d_249_insert", 0, 0], ["add_69_copy_ML", 0, 0], ["cropping2d_123", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}