{"class_name": "Functional", "config": {"name": "model_2863", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_363"}, "name": "input_363", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1_1", "inbound_nodes": [[["input_363", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_635_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_635_insert", "inbound_nodes": [[["conv2d_1_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_637_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_637_insert", "inbound_nodes": [[["max_pooling2d_635_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1845_insert_1", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1845_insert_1", "inbound_nodes": [[["max_pooling2d_637_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_843_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_843_insert", "inbound_nodes": [[["conv2d_1845_insert_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_143_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_143_insert", "inbound_nodes": [[["batch_normalization_843_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1847_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1847_insert", "inbound_nodes": [[["dropout_143_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_53_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_53_insert_1", "inbound_nodes": [[["conv2d_1847_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_145_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_145_insert", "inbound_nodes": [[["flatten_53_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_618", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_618", "inbound_nodes": [[["dropout_145_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_619", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_619", "inbound_nodes": [[["custom_expand_layer_618", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_388", "trainable": true, "dtype": "float32", "padding": [[5, 5], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_388", "inbound_nodes": [[["custom_expand_layer_619", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_292", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [18, 19]]}, "name": "custom_crop_layer_292", "inbound_nodes": [[["custom_pad_layer_388", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_845_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_845_insert", "inbound_nodes": [[["custom_crop_layer_292", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_389", "trainable": true, "dtype": "float32", "padding": [[4, 4], [0, 1], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_389", "inbound_nodes": [[["batch_normalization_845_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_847_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_847_insert_1", "inbound_nodes": [[["custom_pad_layer_389", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_390", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_390", "inbound_nodes": [[["batch_normalization_847_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_293", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [1, 1], [0, 0]]}, "name": "custom_crop_layer_293", "inbound_nodes": [[["custom_pad_layer_390", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1849_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1849_insert", "inbound_nodes": [[["custom_crop_layer_293", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_294", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [1, 2], [0, 1]]}, "name": "custom_crop_layer_294", "inbound_nodes": [[["conv2d_1849_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_639_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_639_insert", "inbound_nodes": [[["custom_crop_layer_294", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_53_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_53_insert_2", "inbound_nodes": [[["batch_normalization_843_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1_2", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1_2", "inbound_nodes": [[["conv2d_1845_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_847_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_847_insert_2", "inbound_nodes": [[["max_pooling2d_637_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1845_insert_2", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1845_insert_2", "inbound_nodes": [[["batch_normalization_843_insert", 0, 0, {}]]]}], "input_layers": [["input_363", 0, 0]], "output_layers": [["max_pooling2d_639_insert", 0, 0], ["flatten_53_insert_2", 0, 0], ["conv2d_1_2", 0, 0], ["batch_normalization_847_insert_2", 0, 0], ["conv2d_1845_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}