{"class_name": "Functional", "config": {"name": "model_3323", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_430"}, "name": "input_430", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_430", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_539_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_539_insert_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_749_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_749_insert", "inbound_nodes": [[["average_pooling2d_539_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2211_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2211_insert", "inbound_nodes": [[["max_pooling2d_749_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_963_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_963_insert", "inbound_nodes": [[["conv2d_2211_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2213_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2213_insert", "inbound_nodes": [[["batch_normalization_963_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2215_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2215_insert", "inbound_nodes": [[["conv2d_2213_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2217_insert_1", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2217_insert_1", "inbound_nodes": [[["conv2d_2215_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2219_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2219_insert", "inbound_nodes": [[["conv2d_2217_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2221_insert_merge1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2221_insert_merge1", "inbound_nodes": [[["conv2d_2219_insert", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_23_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_23_copy_ML", "inbound_nodes": [[["conv2d_2221_insert_merge1", 0, 0, {}], ["batch_normalization_963_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2223_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2223_insert", "inbound_nodes": [[["concatenate_23_copy_ML", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2225_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2225_insert", "inbound_nodes": [[["conv2d_2223_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2227_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2227_insert", "inbound_nodes": [[["conv2d_2225_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_723_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_723_insert", "inbound_nodes": [[["conv2d_2227_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_730", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_730", "inbound_nodes": [[["global_average_pooling2d_723_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_731", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_731", "inbound_nodes": [[["custom_expand_layer_730", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_406", "trainable": true, "dtype": "float32", "padding": [[4, 4], [6, 7], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_406", "inbound_nodes": [[["custom_expand_layer_731", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_751_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_751_insert", "inbound_nodes": [[["custom_pad_layer_406", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_407", "trainable": true, "dtype": "float32", "padding": [[4, 5], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_407", "inbound_nodes": [[["max_pooling2d_751_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_306", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 3]]}, "name": "custom_crop_layer_306", "inbound_nodes": [[["custom_pad_layer_407", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_753_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_753_insert", "inbound_nodes": [[["custom_crop_layer_306", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_408", "trainable": true, "dtype": "float32", "padding": [[2, 2], [4, 5], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_408", "inbound_nodes": [[["max_pooling2d_753_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_541_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_541_insert", "inbound_nodes": [[["custom_pad_layer_408", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_409", "trainable": true, "dtype": "float32", "padding": [[4, 5], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_409", "inbound_nodes": [[["average_pooling2d_541_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_307", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_307", "inbound_nodes": [[["custom_pad_layer_409", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_543_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_543_insert", "inbound_nodes": [[["custom_crop_layer_307", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_410", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_410", "inbound_nodes": [[["average_pooling2d_543_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_308", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [3, 4], [0, 0]]}, "name": "custom_crop_layer_308", "inbound_nodes": [[["custom_pad_layer_410", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_545_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_545_insert", "inbound_nodes": [[["custom_crop_layer_308", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_411", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_411", "inbound_nodes": [[["average_pooling2d_545_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_309", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 0], [2, 2]]}, "name": "custom_crop_layer_309", "inbound_nodes": [[["custom_pad_layer_411", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_755_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_755_insert", "inbound_nodes": [[["custom_crop_layer_309", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_412", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 5], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_412", "inbound_nodes": [[["max_pooling2d_755_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_965_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_965_insert", "inbound_nodes": [[["custom_pad_layer_412", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_413", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_413", "inbound_nodes": [[["batch_normalization_965_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_310", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [0, 0]]}, "name": "custom_crop_layer_310", "inbound_nodes": [[["custom_pad_layer_413", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_967_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_967_insert", "inbound_nodes": [[["custom_crop_layer_310", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_414", "trainable": true, "dtype": "float32", "padding": [[2, 2], [1, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_414", "inbound_nodes": [[["batch_normalization_967_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_311", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_311", "inbound_nodes": [[["custom_pad_layer_414", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_969_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_969_insert", "inbound_nodes": [[["custom_crop_layer_311", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_415", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_415", "inbound_nodes": [[["batch_normalization_969_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_547_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_547_insert", "inbound_nodes": [[["custom_pad_layer_415", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_416", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_416", "inbound_nodes": [[["average_pooling2d_547_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_312", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [0, 0]]}, "name": "custom_crop_layer_312", "inbound_nodes": [[["custom_pad_layer_416", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_971_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_971_insert", "inbound_nodes": [[["custom_crop_layer_312", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2217_insert_2", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2217_insert_2", "inbound_nodes": [[["average_pooling2d_547_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_539_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_539_insert_2", "inbound_nodes": [[["max_pooling2d_751_insert", 0, 0, {}]]]}], "input_layers": [["input_430", 0, 0]], "output_layers": [["batch_normalization_971_insert", 0, 0], ["conv2d_2217_insert_2", 0, 0], ["average_pooling2d_539_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}