{"class_name": "Functional", "config": {"name": "model_3400", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_437"}, "name": "input_437", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_437", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_87_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_87_insert", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_993_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_993_insert", "inbound_nodes": [[["separable_conv2d_87_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2271_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2271_insert", "inbound_nodes": [[["batch_normalization_993_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_769_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_769_insert_1", "inbound_nodes": [[["conv2d_2271_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_737_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_737_insert", "inbound_nodes": [[["max_pooling2d_769_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_742_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_742_insert", "inbound_nodes": [[["global_average_pooling2d_737_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_743_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_743_insert", "inbound_nodes": [[["custom_expand_layer_742_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2273_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2273_insert", "inbound_nodes": [[["custom_expand_layer_743_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_422", "trainable": true, "dtype": "float32", "padding": [[2, 3], [7, 8], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_422", "inbound_nodes": [[["conv2d_2273_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_995_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_995_insert", "inbound_nodes": [[["custom_pad_layer_422", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_423", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_423", "inbound_nodes": [[["batch_normalization_995_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_317", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 0]]}, "name": "custom_crop_layer_317", "inbound_nodes": [[["custom_pad_layer_423", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_771_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_771_insert", "inbound_nodes": [[["custom_crop_layer_317", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_424", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_424", "inbound_nodes": [[["max_pooling2d_771_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_318", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_318", "inbound_nodes": [[["custom_pad_layer_424", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_773_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_773_insert", "inbound_nodes": [[["custom_crop_layer_318", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_425", "trainable": true, "dtype": "float32", "padding": [[2, 3], [3, 3], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_425", "inbound_nodes": [[["max_pooling2d_773_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_775_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_775_insert", "inbound_nodes": [[["custom_pad_layer_425", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_426", "trainable": true, "dtype": "float32", "padding": [[6, 7], [6, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_426", "inbound_nodes": [[["max_pooling2d_775_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_319", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_319", "inbound_nodes": [[["custom_pad_layer_426", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_997_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_997_insert", "inbound_nodes": [[["custom_crop_layer_319", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_427", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_427", "inbound_nodes": [[["batch_normalization_997_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_320", "trainable": true, "dtype": "float32", "cropping": [[3, 4], [2, 2], [0, 0]]}, "name": "custom_crop_layer_320", "inbound_nodes": [[["custom_pad_layer_427", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_89_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 49}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_89_insert", "inbound_nodes": [[["custom_crop_layer_320", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_428", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_428", "inbound_nodes": [[["separable_conv2d_89_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_321", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [0, 0]]}, "name": "custom_crop_layer_321", "inbound_nodes": [[["custom_pad_layer_428", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_999_insert_1_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_999_insert_1_merge1", "inbound_nodes": [[["custom_crop_layer_321", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_22_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_22_copy_ML", "inbound_nodes": [[["batch_normalization_999_insert_1_merge1", 0, 0, {}], ["custom_crop_layer_321", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_429", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_429", "inbound_nodes": [[["add_22_copy_ML", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2275_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2275_insert", "inbound_nodes": [[["custom_pad_layer_429", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_430", "trainable": true, "dtype": "float32", "padding": [[5, 6], [3, 3], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_430", "inbound_nodes": [[["conv2d_2275_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2277_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2277_insert", "inbound_nodes": [[["custom_pad_layer_430", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_431", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 5], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_431", "inbound_nodes": [[["conv2d_2277_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_322", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 0], [0, 0]]}, "name": "custom_crop_layer_322", "inbound_nodes": [[["custom_pad_layer_431", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_91_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 72}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_91_insert", "inbound_nodes": [[["custom_crop_layer_322", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_432", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_432", "inbound_nodes": [[["separable_conv2d_91_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_323", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 0]]}, "name": "custom_crop_layer_323", "inbound_nodes": [[["custom_pad_layer_432", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_93_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 79}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_93_insert", "inbound_nodes": [[["custom_crop_layer_323", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_433", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_433", "inbound_nodes": [[["separable_conv2d_93_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_324", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 1], [0, 0]]}, "name": "custom_crop_layer_324", "inbound_nodes": [[["custom_pad_layer_433", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1001_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1001_insert", "inbound_nodes": [[["custom_crop_layer_324", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_434", "trainable": true, "dtype": "float32", "padding": [[0, 1], [4, 5], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_434", "inbound_nodes": [[["batch_normalization_1001_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_999_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_999_insert_2", "inbound_nodes": [[["conv2d_2273_insert", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_95_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 97}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_95_insert", "inbound_nodes": [[["custom_pad_layer_434", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_769_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_769_insert_2", "inbound_nodes": [[["batch_normalization_999_insert_2", 0, 0, {}]]]}], "input_layers": [["input_437", 0, 0]], "output_layers": [["separable_conv2d_95_insert", 0, 0], ["max_pooling2d_769_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}