{"class_name": "Functional", "config": {"name": "model_8079", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1015"}, "name": "input_1015", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_1015", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5467_insert_1", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5467_insert_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1897_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1897_insert", "inbound_nodes": [[["conv2d_5467_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2379_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2379_insert", "inbound_nodes": [[["max_pooling2d_1897_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1899_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1899_insert", "inbound_nodes": [[["batch_normalization_2379_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_381_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_381_insert", "inbound_nodes": [[["max_pooling2d_1899_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5469_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5469_insert", "inbound_nodes": [[["dropout_381_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_132_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_132_insert_1", "inbound_nodes": [[["conv2d_5469_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_383_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_383_insert", "inbound_nodes": [[["flatten_132_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1726", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1726", "inbound_nodes": [[["dropout_383_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1727", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1727", "inbound_nodes": [[["custom_expand_layer_1726", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1066", "trainable": true, "dtype": "float32", "padding": [[7, 8], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1066", "inbound_nodes": [[["custom_expand_layer_1727", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_788", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [23, 24]]}, "name": "custom_crop_layer_788", "inbound_nodes": [[["custom_pad_layer_1066", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5471_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5471_insert", "inbound_nodes": [[["custom_crop_layer_788", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1067", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_1067", "inbound_nodes": [[["conv2d_5471_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_789", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [0, 0]]}, "name": "custom_crop_layer_789", "inbound_nodes": [[["custom_pad_layer_1067", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1901_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1901_insert", "inbound_nodes": [[["custom_crop_layer_789", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1068", "trainable": true, "dtype": "float32", "padding": [[0, 0], [8, 9], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_1068", "inbound_nodes": [[["max_pooling2d_1901_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_790", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_790", "inbound_nodes": [[["custom_pad_layer_1068", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2381_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2381_insert", "inbound_nodes": [[["custom_crop_layer_790", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1069", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1069", "inbound_nodes": [[["batch_normalization_2381_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_791", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [6, 6], [0, 1]]}, "name": "custom_crop_layer_791", "inbound_nodes": [[["custom_pad_layer_1069", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2383_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2383_insert", "inbound_nodes": [[["custom_crop_layer_791", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5467_insert_2", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5467_insert_2", "inbound_nodes": [[["batch_normalization_2381_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_132_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_132_insert_2", "inbound_nodes": [[["batch_normalization_2383_insert", 0, 0, {}]]]}], "input_layers": [["input_1015", 0, 0]], "output_layers": [["batch_normalization_2383_insert", 0, 0], ["conv2d_5467_insert_2", 0, 0], ["flatten_132_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}