{"class_name": "Functional", "config": {"name": "model_2098", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_273"}, "name": "input_273", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_273", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1441_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1441_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_473_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_473_insert", "inbound_nodes": [[["conv2d_1441_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1443_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1443_insert", "inbound_nodes": [[["max_pooling2d_473_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1445_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1445_insert", "inbound_nodes": [[["conv2d_1443_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_597_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_597_insert", "inbound_nodes": [[["conv2d_1445_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1447_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1447_insert", "inbound_nodes": [[["batch_normalization_597_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1449_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1449_insert", "inbound_nodes": [[["conv2d_1447_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1451_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1451_insert", "inbound_nodes": [[["conv2d_1449_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_347_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_347_insert", "inbound_nodes": [[["conv2d_1451_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1453_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1453_insert", "inbound_nodes": [[["average_pooling2d_347_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1455_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1455_insert", "inbound_nodes": [[["conv2d_1453_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1457_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1457_insert", "inbound_nodes": [[["conv2d_1455_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_479_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_479_insert", "inbound_nodes": [[["conv2d_1457_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_464", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_464", "inbound_nodes": [[["global_average_pooling2d_479_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_465", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_465", "inbound_nodes": [[["custom_expand_layer_464", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_221", "trainable": true, "dtype": "float32", "padding": [[3, 3], [7, 7], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_221", "inbound_nodes": [[["custom_expand_layer_465", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_599_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_599_insert", "inbound_nodes": [[["custom_pad_layer_221", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_160", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_160", "inbound_nodes": [[["batch_normalization_599_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_349_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_349_insert_1", "inbound_nodes": [[["custom_crop_layer_160", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_222", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_222", "inbound_nodes": [[["average_pooling2d_349_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_161", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_161", "inbound_nodes": [[["custom_pad_layer_222", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_475_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_475_insert", "inbound_nodes": [[["custom_crop_layer_161", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_223", "trainable": true, "dtype": "float32", "padding": [[7, 7], [0, 1], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_223", "inbound_nodes": [[["max_pooling2d_475_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_351_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_351_insert", "inbound_nodes": [[["custom_pad_layer_223", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_224", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_224", "inbound_nodes": [[["average_pooling2d_351_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_162", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [0, 0]]}, "name": "custom_crop_layer_162", "inbound_nodes": [[["custom_pad_layer_224", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_353_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_353_insert", "inbound_nodes": [[["custom_crop_layer_162", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_225", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_225", "inbound_nodes": [[["average_pooling2d_353_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_163", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_163", "inbound_nodes": [[["custom_pad_layer_225", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_601_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_601_insert", "inbound_nodes": [[["custom_crop_layer_163", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_226", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_226", "inbound_nodes": [[["batch_normalization_601_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_164", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [2, 2], [0, 0]]}, "name": "custom_crop_layer_164", "inbound_nodes": [[["custom_pad_layer_226", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_355_insert_merge1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_355_insert_merge1", "inbound_nodes": [[["custom_crop_layer_164", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_13_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_13_copy_ML", "inbound_nodes": [[["average_pooling2d_355_insert_merge1", 0, 0, {}], ["custom_crop_layer_164", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_227", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_227", "inbound_nodes": [[["concatenate_13_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_165", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 5]]}, "name": "custom_crop_layer_165", "inbound_nodes": [[["custom_pad_layer_227", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_603_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_603_insert", "inbound_nodes": [[["custom_crop_layer_165", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_228", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_228", "inbound_nodes": [[["batch_normalization_603_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_166", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 0], [0, 0]]}, "name": "custom_crop_layer_166", "inbound_nodes": [[["custom_pad_layer_228", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_605_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_605_insert", "inbound_nodes": [[["custom_crop_layer_166", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_229", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_229", "inbound_nodes": [[["batch_normalization_605_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_167", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [1, 2]]}, "name": "custom_crop_layer_167", "inbound_nodes": [[["custom_pad_layer_229", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_477_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_477_insert", "inbound_nodes": [[["custom_crop_layer_167", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_230", "trainable": true, "dtype": "float32", "padding": [[2, 2], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_230", "inbound_nodes": [[["max_pooling2d_477_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_168", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_168", "inbound_nodes": [[["custom_pad_layer_230", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_479_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_479_insert", "inbound_nodes": [[["custom_crop_layer_168", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_349_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_349_insert_2", "inbound_nodes": [[["max_pooling2d_475_insert", 0, 0, {}]]]}], "input_layers": [["input_273", 0, 0]], "output_layers": [["max_pooling2d_479_insert", 0, 0], ["average_pooling2d_349_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}