{"class_name": "Functional", "config": {"name": "model_1825", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_236"}, "name": "input_236", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["input_236", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_285_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_285_insert", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1253_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1253_insert", "inbound_nodes": [[["average_pooling2d_285_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_25_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_25_insert_1", "inbound_nodes": [[["conv2d_1253_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_73_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_73_insert", "inbound_nodes": [[["flatten_25_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_402", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_402", "inbound_nodes": [[["dropout_73_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_403", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_403", "inbound_nodes": [[["custom_expand_layer_402", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_199", "trainable": true, "dtype": "float32", "padding": [[4, 5], [7, 7], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_199", "inbound_nodes": [[["custom_expand_layer_403", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_146", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [92, 93]]}, "name": "custom_crop_layer_146", "inbound_nodes": [[["custom_pad_layer_199", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_287_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_287_insert", "inbound_nodes": [[["custom_crop_layer_146", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_25_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_25_insert_2", "inbound_nodes": [[["average_pooling2d_285_insert", 0, 0, {}]]]}], "input_layers": [["input_236", 0, 0]], "output_layers": [["average_pooling2d_287_insert", 0, 0], ["flatten_25_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}