{"class_name": "Functional", "config": {"name": "model_1818", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_235"}, "name": "input_235", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, 49, 1], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "shared_object_id": 1}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 3}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "name": "lstm_1", "inbound_nodes": [[["input_235", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_69_insert", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "dropout_69_insert", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_7_insert", "trainable": true, "batch_input_shape": [null, null, null], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 8, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "shared_object_id": 7}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 8}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 9}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "name": "lstm_7_insert", "inbound_nodes": [[["dropout_69_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_198", "trainable": true, "dtype": "float32", "padding": [[1, 2]], "constant_values": 2}, "name": "custom_pad_layer_198", "inbound_nodes": [[["lstm_7_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_71_insert", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "dropout_71_insert", "inbound_nodes": [[["custom_pad_layer_198", 0, 0, {}]]]}], "input_layers": [["input_235", 0, 0]], "output_layers": [["dropout_71_insert", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}