{"class_name": "Functional", "config": {"name": "model_2120", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_275"}, "name": "input_275", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_275", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1463_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1463_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_481_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_481_insert_1", "inbound_nodes": [[["conv2d_1463_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_113_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_113_insert", "inbound_nodes": [[["max_pooling2d_481_insert_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_483_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_483_insert", "inbound_nodes": [[["zero_padding2d_113_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_468_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_468_insert", "inbound_nodes": [[["global_average_pooling2d_483_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_469_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_469_insert", "inbound_nodes": [[["custom_expand_layer_468_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1465_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1465_insert", "inbound_nodes": [[["custom_expand_layer_469_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_609_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_609_insert", "inbound_nodes": [[["conv2d_1465_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1467_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1467_insert", "inbound_nodes": [[["batch_normalization_609_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1469_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1469_insert", "inbound_nodes": [[["conv2d_1467_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_231", "trainable": true, "dtype": "float32", "padding": [[2, 3], [5, 5], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_231", "inbound_nodes": [[["conv2d_1469_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1471_insert_1", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1471_insert_1", "inbound_nodes": [[["custom_pad_layer_231", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_232", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_232", "inbound_nodes": [[["conv2d_1471_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_611_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_611_insert_merge1", "inbound_nodes": [[["custom_pad_layer_232", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_10_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_10_copy_ML", "inbound_nodes": [[["batch_normalization_611_insert_merge1", 0, 0, {}], ["custom_pad_layer_232", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_233", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_233", "inbound_nodes": [[["add_10_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_169", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [0, 0]]}, "name": "custom_crop_layer_169", "inbound_nodes": [[["custom_pad_layer_233", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_613_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_613_insert", "inbound_nodes": [[["custom_crop_layer_169", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_234", "trainable": true, "dtype": "float32", "padding": [[0, 1], [1, 2], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_234", "inbound_nodes": [[["batch_normalization_613_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_615_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_615_insert", "inbound_nodes": [[["custom_pad_layer_234", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_170", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [4, 4], [3, 4]]}, "name": "custom_crop_layer_170", "inbound_nodes": [[["batch_normalization_615_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1471_insert_2", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1471_insert_2", "inbound_nodes": [[["max_pooling2d_481_insert_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_481_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_481_insert_2", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_617_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_617_insert", "inbound_nodes": [[["custom_crop_layer_170", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_24", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_24", "inbound_nodes": [[["conv2d_1471_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_25", "trainable": true, "dtype": "float32", "cropping": [[52, 52], [52, 52]], "data_format": "channels_last"}, "name": "cropping2d_25", "inbound_nodes": [[["max_pooling2d_481_insert_2", 0, 0, {}]]]}], "input_layers": [["input_275", 0, 0]], "output_layers": [["batch_normalization_617_insert", 0, 0], ["cropping2d_24", 0, 0], ["cropping2d_25", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}