{"class_name": "Functional", "config": {"name": "model_2154", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_278"}, "name": "input_278", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_278", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_45_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_45_insert", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_485_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_485_insert", "inbound_nodes": [[["separable_conv2d_45_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_621_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_621_insert_1", "inbound_nodes": [[["max_pooling2d_485_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1481_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1481_insert", "inbound_nodes": [[["batch_normalization_621_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1483_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1483_insert", "inbound_nodes": [[["conv2d_1481_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_489_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_489_insert", "inbound_nodes": [[["conv2d_1483_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_474", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_474", "inbound_nodes": [[["global_average_pooling2d_489_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_475", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_475", "inbound_nodes": [[["custom_expand_layer_474", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_235", "trainable": true, "dtype": "float32", "padding": [[3, 3], [8, 9], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_235", "inbound_nodes": [[["custom_expand_layer_475", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_487_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_487_insert_1", "inbound_nodes": [[["custom_pad_layer_235", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_236", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_236", "inbound_nodes": [[["max_pooling2d_487_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1485_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1485_insert", "inbound_nodes": [[["custom_pad_layer_236", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_237", "trainable": true, "dtype": "float32", "padding": [[7, 7], [0, 1], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_237", "inbound_nodes": [[["conv2d_1485_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_623_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_623_insert", "inbound_nodes": [[["custom_pad_layer_237", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_238", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_238", "inbound_nodes": [[["batch_normalization_623_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_171", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [0, 0], [0, 0]]}, "name": "custom_crop_layer_171", "inbound_nodes": [[["custom_pad_layer_238", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_489_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_489_insert", "inbound_nodes": [[["custom_crop_layer_171", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_239", "trainable": true, "dtype": "float32", "padding": [[0, 1], [6, 6], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_239", "inbound_nodes": [[["max_pooling2d_489_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_491_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_491_insert", "inbound_nodes": [[["custom_pad_layer_239", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_240", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_240", "inbound_nodes": [[["max_pooling2d_491_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_172", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [1, 2]]}, "name": "custom_crop_layer_172", "inbound_nodes": [[["custom_pad_layer_240", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_625_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_625_insert_1", "inbound_nodes": [[["custom_crop_layer_172", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_241", "trainable": true, "dtype": "float32", "padding": [[5, 5], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_241", "inbound_nodes": [[["batch_normalization_625_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_173", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 4]]}, "name": "custom_crop_layer_173", "inbound_nodes": [[["custom_pad_layer_241", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_627_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_627_insert", "inbound_nodes": [[["custom_crop_layer_173", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_242", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_242", "inbound_nodes": [[["batch_normalization_627_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_174", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [3, 3], [0, 0]]}, "name": "custom_crop_layer_174", "inbound_nodes": [[["custom_pad_layer_242", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_629_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_629_insert_merge1", "inbound_nodes": [[["custom_crop_layer_174", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_12_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_12_copy_ML", "inbound_nodes": [[["batch_normalization_629_insert_merge1", 0, 0, {}], ["custom_crop_layer_174", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_175", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [2, 3], [2, 3]]}, "name": "custom_crop_layer_175", "inbound_nodes": [[["add_12_copy_ML", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_47_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 66}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_47_insert", "inbound_nodes": [[["custom_crop_layer_175", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_243", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 5], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_243", "inbound_nodes": [[["separable_conv2d_47_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_176", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_176", "inbound_nodes": [[["custom_pad_layer_243", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_49_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 73}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_49_insert", "inbound_nodes": [[["custom_crop_layer_176", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_244", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_244", "inbound_nodes": [[["separable_conv2d_49_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_177", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [4, 4], [0, 0]]}, "name": "custom_crop_layer_177", "inbound_nodes": [[["custom_pad_layer_244", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_51_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 80}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_51_insert", "inbound_nodes": [[["custom_crop_layer_177", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_245", "trainable": true, "dtype": "float32", "padding": [[2, 2], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_245", "inbound_nodes": [[["separable_conv2d_51_insert", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d_53_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 86}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "separable_conv2d_53_insert", "inbound_nodes": [[["custom_pad_layer_245", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_246", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_246", "inbound_nodes": [[["separable_conv2d_53_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_178", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [2, 3], [0, 0]]}, "name": "custom_crop_layer_178", "inbound_nodes": [[["custom_pad_layer_246", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_621_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_621_insert_2", "inbound_nodes": [[["separable_conv2d_45_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1487_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1487_insert", "inbound_nodes": [[["custom_crop_layer_178", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_487_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_487_insert_2", "inbound_nodes": [[["batch_normalization_625_insert_1", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_26", "trainable": true, "dtype": "float32", "cropping": [[69, 69], [69, 69]], "data_format": "channels_last"}, "name": "cropping2d_26", "inbound_nodes": [[["batch_normalization_621_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_625_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_625_insert_2", "inbound_nodes": [[["conv2d_1487_insert", 0, 0, {}]]]}], "input_layers": [["input_278", 0, 0]], "output_layers": [["max_pooling2d_487_insert_2", 0, 0], ["cropping2d_26", 0, 0], ["batch_normalization_625_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}