{"class_name": "Functional", "config": {"name": "model_27", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9_1", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9_1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7_insert", "inbound_nodes": [[["conv2d_9_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1_insert", "inbound_nodes": [[["conv2d_7_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1_insert", "inbound_nodes": [[["average_pooling2d_1_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_9_insert", "inbound_nodes": [[["flatten_1_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_3", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_3", "inbound_nodes": [[["dropout_9_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_4", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_4", "inbound_nodes": [[["custom_expand_layer_3", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_5", "trainable": true, "dtype": "float32", "padding": [[8, 9], [6, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_5", "inbound_nodes": [[["custom_expand_layer_4", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_4", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [501, 501]]}, "name": "custom_crop_layer_4", "inbound_nodes": [[["custom_pad_layer_5", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_3_insert", "inbound_nodes": [[["custom_crop_layer_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9_2", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9_2", "inbound_nodes": [[["average_pooling2d_3_insert", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["average_pooling2d_3_insert", 0, 0], ["conv2d_9_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}