{"class_name": "Functional", "config": {"name": "model_229", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_115_insert_1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_115_insert_1", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_11_insert", "inbound_nodes": [[["conv2d_115_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_5_insert_1", "inbound_nodes": [[["zero_padding2d_11_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_29_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_29_insert_1", "inbound_nodes": [[["depthwise_conv2d_5_insert_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3_insert_1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3_insert_1", "inbound_nodes": [[["global_average_pooling2d_29_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_33_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_33_insert", "inbound_nodes": [[["re_lu_3_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_34_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_34_insert", "inbound_nodes": [[["custom_expand_layer_33_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_7_insert", "inbound_nodes": [[["custom_expand_layer_34_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_117_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_117_insert", "inbound_nodes": [[["depthwise_conv2d_7_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_71_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_71_insert", "inbound_nodes": [[["conv2d_117_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_46", "trainable": true, "dtype": "float32", "padding": [[2, 3], [3, 4], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_46", "inbound_nodes": [[["batch_normalization_71_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_9_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_9_insert", "inbound_nodes": [[["custom_pad_layer_46", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_47", "trainable": true, "dtype": "float32", "padding": [[7, 8], [1, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_47", "inbound_nodes": [[["depthwise_conv2d_9_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_33", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_33", "inbound_nodes": [[["custom_pad_layer_47", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_119_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_119_insert", "inbound_nodes": [[["custom_crop_layer_33", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_48", "trainable": true, "dtype": "float32", "padding": [[3, 4], [3, 3], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_48", "inbound_nodes": [[["conv2d_119_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13_insert_1", "inbound_nodes": [[["custom_pad_layer_48", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_49", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_49", "inbound_nodes": [[["zero_padding2d_13_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_34", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [1, 1], [0, 0]]}, "name": "custom_crop_layer_34", "inbound_nodes": [[["custom_pad_layer_49", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_121_insert_1", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_121_insert_1", "inbound_nodes": [[["custom_crop_layer_34", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_50", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [7, 7]], "constant_values": 2}, "name": "custom_pad_layer_50", "inbound_nodes": [[["conv2d_121_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_35", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_35", "inbound_nodes": [[["custom_pad_layer_50", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_5_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_5_insert", "inbound_nodes": [[["custom_crop_layer_35", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_51", "trainable": true, "dtype": "float32", "padding": [[2, 2], [4, 4], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_51", "inbound_nodes": [[["re_lu_5_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_15_insert", "inbound_nodes": [[["custom_pad_layer_51", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_36", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [5, 5], [3, 3]]}, "name": "custom_crop_layer_36", "inbound_nodes": [[["zero_padding2d_15_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_7_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_7_insert", "inbound_nodes": [[["custom_crop_layer_36", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_52", "trainable": true, "dtype": "float32", "padding": [[2, 2], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_52", "inbound_nodes": [[["re_lu_7_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_37", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_37", "inbound_nodes": [[["custom_pad_layer_52", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_73_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_73_insert", "inbound_nodes": [[["custom_crop_layer_37", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_53", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_53", "inbound_nodes": [[["batch_normalization_73_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_38", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 1], [0, 0]]}, "name": "custom_crop_layer_38", "inbound_nodes": [[["custom_pad_layer_53", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_9_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_9_insert", "inbound_nodes": [[["custom_crop_layer_38", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_54", "trainable": true, "dtype": "float32", "padding": [[5, 6], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_54", "inbound_nodes": [[["re_lu_9_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_39", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 3]]}, "name": "custom_crop_layer_39", "inbound_nodes": [[["custom_pad_layer_54", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_11_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_11_insert", "inbound_nodes": [[["custom_crop_layer_39", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_55", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_55", "inbound_nodes": [[["depthwise_conv2d_11_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_40", "trainable": true, "dtype": "float32", "cropping": [[3, 4], [1, 1], [0, 0]]}, "name": "custom_crop_layer_40", "inbound_nodes": [[["custom_pad_layer_55", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_75_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_75_insert", "inbound_nodes": [[["custom_crop_layer_40", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_56", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_56", "inbound_nodes": [[["batch_normalization_75_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_11_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_11_insert", "inbound_nodes": [[["custom_pad_layer_56", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_57", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_57", "inbound_nodes": [[["re_lu_11_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_41", "trainable": true, "dtype": "float32", "cropping": [[7, 7], [2, 2], [0, 0]]}, "name": "custom_crop_layer_41", "inbound_nodes": [[["custom_pad_layer_57", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_13_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_13_insert", "inbound_nodes": [[["custom_crop_layer_41", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_58", "trainable": true, "dtype": "float32", "padding": [[5, 6], [7, 8], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_58", "inbound_nodes": [[["depthwise_conv2d_13_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_42", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [6, 6]]}, "name": "custom_crop_layer_42", "inbound_nodes": [[["custom_pad_layer_58", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17_insert", "inbound_nodes": [[["custom_crop_layer_42", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_59", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_59", "inbound_nodes": [[["zero_padding2d_17_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_43", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_43", "inbound_nodes": [[["custom_pad_layer_59", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_77_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_77_insert", "inbound_nodes": [[["custom_crop_layer_43", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_44", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [0, 1], [2, 3]]}, "name": "custom_crop_layer_44", "inbound_nodes": [[["batch_normalization_77_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_79_insert_2", "inbound_nodes": [[["depthwise_conv2d_7_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3_insert_2_merge1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3_insert_2_merge1", "inbound_nodes": [[["batch_normalization_71_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_79_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_79_insert_1", "inbound_nodes": [[["custom_crop_layer_44", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_29_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_29_insert_2", "inbound_nodes": [[["re_lu_9_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_121_insert_2", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_121_insert_2", "inbound_nodes": [[["batch_normalization_79_insert_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_3_copy_ML", "inbound_nodes": [[["re_lu_3_insert_2_merge1", 0, 0, {}], ["batch_normalization_71_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_5_insert_2", "inbound_nodes": [[["re_lu_5_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_115_insert_2", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_115_insert_2", "inbound_nodes": [[["re_lu_5_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13_insert_2", "inbound_nodes": [[["re_lu_7_insert", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0]], "output_layers": [["batch_normalization_79_insert_1", 0, 0], ["global_average_pooling2d_29_insert_2", 0, 0], ["conv2d_121_insert_2", 0, 0], ["add_3_copy_ML", 0, 0], ["depthwise_conv2d_5_insert_2", 0, 0], ["conv2d_115_insert_2", 0, 0], ["zero_padding2d_13_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}