{"class_name": "Functional", "config": {"name": "model_7125", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_911"}, "name": "input_911", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_911", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2081_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2081_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1677_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1677_insert_1", "inbound_nodes": [[["batch_normalization_2081_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1679_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1679_insert", "inbound_nodes": [[["max_pooling2d_1677_insert_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_337_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_337_insert", "inbound_nodes": [[["max_pooling2d_1679_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_122_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_122_insert_1", "inbound_nodes": [[["dropout_337_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1555_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1555_insert", "inbound_nodes": [[["flatten_122_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1556_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1556_insert", "inbound_nodes": [[["custom_expand_layer_1555_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4869_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4869_insert", "inbound_nodes": [[["custom_expand_layer_1556_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4871_insert_1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4871_insert_1", "inbound_nodes": [[["conv2d_4869_insert", 0, 0, {}]]]}, {"class_name": "CustomDropDimLayer", "config": {"name": "custom_drop_dim_layer_10", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_drop_dim_layer_10", "inbound_nodes": [[["conv2d_4871_insert_1", 0, 0, {}]]]}, {"class_name": "CustomDropDimLayer", "config": {"name": "custom_drop_dim_layer_11", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_drop_dim_layer_11", "inbound_nodes": [[["custom_drop_dim_layer_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_339_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_339_insert", "inbound_nodes": [[["custom_drop_dim_layer_11", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1557", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1557", "inbound_nodes": [[["dropout_339_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1558", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1558", "inbound_nodes": [[["custom_expand_layer_1557", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_882", "trainable": true, "dtype": "float32", "padding": [[5, 5], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_882", "inbound_nodes": [[["custom_expand_layer_1558", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1681_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1681_insert", "inbound_nodes": [[["custom_pad_layer_882", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_883", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 4], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_883", "inbound_nodes": [[["max_pooling2d_1681_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4873_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4873_insert", "inbound_nodes": [[["custom_pad_layer_883", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_884", "trainable": true, "dtype": "float32", "padding": [[4, 4], [2, 3], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_884", "inbound_nodes": [[["conv2d_4873_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2083_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2083_insert", "inbound_nodes": [[["custom_pad_layer_884", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_885", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_885", "inbound_nodes": [[["batch_normalization_2083_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_659", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_659", "inbound_nodes": [[["custom_pad_layer_885", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2085_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2085_insert_1", "inbound_nodes": [[["custom_crop_layer_659", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1677_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1677_insert_2", "inbound_nodes": [[["conv2d_4873_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_122_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_122_insert_2", "inbound_nodes": [[["batch_normalization_2085_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2085_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2085_insert_2", "inbound_nodes": [[["max_pooling2d_1677_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4871_insert_2", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4871_insert_2", "inbound_nodes": [[["batch_normalization_2081_insert", 0, 0, {}]]]}], "input_layers": [["input_911", 0, 0]], "output_layers": [["max_pooling2d_1677_insert_2", 0, 0], ["flatten_122_insert_2", 0, 0], ["batch_normalization_2085_insert_2", 0, 0], ["conv2d_4871_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}