{"class_name": "Functional", "config": {"name": "model_8967", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1122"}, "name": "input_1122", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["input_1122", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1447_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1447_insert", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2087_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2087_insert_1", "inbound_nodes": [[["average_pooling2d_1447_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2659_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2659_insert", "inbound_nodes": [[["max_pooling2d_2087_insert_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_513_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_513_insert", "inbound_nodes": [[["batch_normalization_2659_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6019_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6019_insert", "inbound_nodes": [[["zero_padding2d_513_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1879_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1879_insert", "inbound_nodes": [[["conv2d_6019_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1893_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1893_insert", "inbound_nodes": [[["global_average_pooling2d_1879_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1894_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1894_insert", "inbound_nodes": [[["custom_expand_layer_1893_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6021_insert_merge1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6021_insert_merge1", "inbound_nodes": [[["custom_expand_layer_1894_insert", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_61_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_61_copy_ML", "inbound_nodes": [[["conv2d_6021_insert_merge1", 0, 0, {}], ["custom_expand_layer_1894_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6023_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6023_insert", "inbound_nodes": [[["concatenate_61_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1215", "trainable": true, "dtype": "float32", "padding": [[3, 3], [6, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1215", "inbound_nodes": [[["conv2d_6023_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6025_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6025_insert", "inbound_nodes": [[["custom_pad_layer_1215", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1216", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1216", "inbound_nodes": [[["conv2d_6025_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_895", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [1, 1]]}, "name": "custom_crop_layer_895", "inbound_nodes": [[["custom_pad_layer_1216", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1449_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1449_insert", "inbound_nodes": [[["custom_crop_layer_895", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1217", "trainable": true, "dtype": "float32", "padding": [[7, 8], [4, 4], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_1217", "inbound_nodes": [[["average_pooling2d_1449_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1451_insert_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1451_insert_1", "inbound_nodes": [[["custom_pad_layer_1217", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1218", "trainable": true, "dtype": "float32", "padding": [[0, 1], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1218", "inbound_nodes": [[["average_pooling2d_1451_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_896", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_896", "inbound_nodes": [[["custom_pad_layer_1218", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2661_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2661_insert", "inbound_nodes": [[["custom_crop_layer_896", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1219", "trainable": true, "dtype": "float32", "padding": [[4, 4], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_1219", "inbound_nodes": [[["batch_normalization_2661_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_897", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 3], [0, 0]]}, "name": "custom_crop_layer_897", "inbound_nodes": [[["custom_pad_layer_1219", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2663_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2663_insert", "inbound_nodes": [[["custom_crop_layer_897", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1220", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_1220", "inbound_nodes": [[["batch_normalization_2663_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_898", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [1, 1], [0, 0]]}, "name": "custom_crop_layer_898", "inbound_nodes": [[["custom_pad_layer_1220", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6027_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6027_insert", "inbound_nodes": [[["custom_crop_layer_898", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1221", "trainable": true, "dtype": "float32", "padding": [[2, 3], [1, 2], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_1221", "inbound_nodes": [[["conv2d_6027_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2665_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2665_insert_1", "inbound_nodes": [[["custom_pad_layer_1221", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1222", "trainable": true, "dtype": "float32", "padding": [[2, 3], [5, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1222", "inbound_nodes": [[["batch_normalization_2665_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_899", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_899", "inbound_nodes": [[["custom_pad_layer_1222", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2667_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2667_insert", "inbound_nodes": [[["custom_crop_layer_899", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1223", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_1223", "inbound_nodes": [[["batch_normalization_2667_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_900", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [5, 5], [0, 0]]}, "name": "custom_crop_layer_900", "inbound_nodes": [[["custom_pad_layer_1223", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1451_insert_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_1451_insert_2", "inbound_nodes": [[["conv2d_6019_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2087_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2087_insert_2", "inbound_nodes": [[["zero_padding2d_513_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6029_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6029_insert", "inbound_nodes": [[["custom_crop_layer_900", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2665_insert_2_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2665_insert_2_1", "inbound_nodes": [[["average_pooling2d_1451_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_125", "trainable": true, "dtype": "float32", "cropping": [[9, 9], [9, 9]], "data_format": "channels_last"}, "name": "cropping2d_125", "inbound_nodes": [[["max_pooling2d_2087_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2665_insert_2_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2665_insert_2_2", "inbound_nodes": [[["conv2d_6025_insert", 0, 0, {}]]]}], "input_layers": [["input_1122", 0, 0]], "output_layers": [["conv2d_6029_insert", 0, 0], ["batch_normalization_2665_insert_2_1", 0, 0], ["cropping2d_125", 0, 0], ["batch_normalization_2665_insert_2_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}