{"class_name": "Functional", "config": {"name": "model_9083", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1135"}, "name": "input_1135", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_1135", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2119_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2119_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2703_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2703_insert_1", "inbound_nodes": [[["max_pooling2d_2119_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_517_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_517_insert", "inbound_nodes": [[["batch_normalization_2703_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6107_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6107_insert", "inbound_nodes": [[["zero_padding2d_517_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6109_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6109_insert", "inbound_nodes": [[["conv2d_6107_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6111_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6111_insert", "inbound_nodes": [[["conv2d_6109_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1905_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1905_insert", "inbound_nodes": [[["conv2d_6111_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1915_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1915_insert", "inbound_nodes": [[["global_average_pooling2d_1905_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1916_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1916_insert", "inbound_nodes": [[["custom_expand_layer_1915_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6113_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6113_insert", "inbound_nodes": [[["custom_expand_layer_1916_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1241", "trainable": true, "dtype": "float32", "padding": [[8, 8], [6, 6], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_1241", "inbound_nodes": [[["conv2d_6113_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2705_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2705_insert_merge1", "inbound_nodes": [[["custom_pad_layer_1241", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_72_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_72_copy_ML", "inbound_nodes": [[["batch_normalization_2705_insert_merge1", 0, 0, {}], ["custom_pad_layer_1241", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1242", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1242", "inbound_nodes": [[["add_72_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_914", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [0, 0], [2, 3]]}, "name": "custom_crop_layer_914", "inbound_nodes": [[["custom_pad_layer_1242", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2707_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2707_insert", "inbound_nodes": [[["custom_crop_layer_914", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1243", "trainable": true, "dtype": "float32", "padding": [[5, 6], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1243", "inbound_nodes": [[["batch_normalization_2707_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6115_insert_1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6115_insert_1", "inbound_nodes": [[["custom_pad_layer_1243", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1244", "trainable": true, "dtype": "float32", "padding": [[4, 5], [0, 1], [6, 6]], "constant_values": 2}, "name": "custom_pad_layer_1244", "inbound_nodes": [[["conv2d_6115_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2709_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2709_insert", "inbound_nodes": [[["custom_pad_layer_1244", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1245", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1245", "inbound_nodes": [[["batch_normalization_2709_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6115_insert_2", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6115_insert_2", "inbound_nodes": [[["max_pooling2d_2119_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_915", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [0, 0], [6, 6]]}, "name": "custom_crop_layer_915", "inbound_nodes": [[["custom_pad_layer_1245", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2703_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2703_insert_2", "inbound_nodes": [[["conv2d_6115_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2711_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2711_insert", "inbound_nodes": [[["custom_crop_layer_915", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_128", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_128", "inbound_nodes": [[["conv2d_6115_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_129", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_129", "inbound_nodes": [[["batch_normalization_2703_insert_2", 0, 0, {}]]]}], "input_layers": [["input_1135", 0, 0]], "output_layers": [["batch_normalization_2711_insert", 0, 0], ["cropping2d_128", 0, 0], ["cropping2d_129", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}