{"class_name": "Functional", "config": {"name": "model_7811", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_991"}, "name": "input_991", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_1", "inbound_nodes": [[["input_991", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2285_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2285_insert", "inbound_nodes": [[["Conv1_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_231_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_231_insert", "inbound_nodes": [[["batch_normalization_2285_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5323_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5323_insert", "inbound_nodes": [[["re_lu_231_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_295_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_295_insert", "inbound_nodes": [[["conv2d_5323_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5325_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5325_insert", "inbound_nodes": [[["depthwise_conv2d_295_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1665_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1665_insert_1", "inbound_nodes": [[["conv2d_5325_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1678_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1678_insert", "inbound_nodes": [[["global_average_pooling2d_1665_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1679_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1679_insert", "inbound_nodes": [[["custom_expand_layer_1678_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_433_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_433_insert", "inbound_nodes": [[["custom_expand_layer_1679_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_297_insert_merge1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_297_insert_merge1", "inbound_nodes": [[["zero_padding2d_433_insert", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_61_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_61_copy_ML", "inbound_nodes": [[["depthwise_conv2d_297_insert_merge1", 0, 0, {}], ["zero_padding2d_433_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_991", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_991", "inbound_nodes": [[["add_61_copy_ML", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_435_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_435_insert", "inbound_nodes": [[["custom_pad_layer_991", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_992", "trainable": true, "dtype": "float32", "padding": [[0, 0], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_992", "inbound_nodes": [[["zero_padding2d_435_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_731", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [0, 0], [1, 1]]}, "name": "custom_crop_layer_731", "inbound_nodes": [[["custom_pad_layer_992", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2287_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2287_insert", "inbound_nodes": [[["custom_crop_layer_731", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_993", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_993", "inbound_nodes": [[["batch_normalization_2287_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_732", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [2, 3]]}, "name": "custom_crop_layer_732", "inbound_nodes": [[["custom_pad_layer_993", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_299_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_299_insert", "inbound_nodes": [[["custom_crop_layer_732", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_994", "trainable": true, "dtype": "float32", "padding": [[6, 6], [7, 7], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_994", "inbound_nodes": [[["depthwise_conv2d_299_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5327_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5327_insert", "inbound_nodes": [[["custom_pad_layer_994", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_995", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_995", "inbound_nodes": [[["conv2d_5327_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_733", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [3, 3], [0, 0]]}, "name": "custom_crop_layer_733", "inbound_nodes": [[["custom_pad_layer_995", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_437_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_437_insert", "inbound_nodes": [[["custom_crop_layer_733", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_996", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_996", "inbound_nodes": [[["zero_padding2d_437_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_734", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [2, 3]]}, "name": "custom_crop_layer_734", "inbound_nodes": [[["custom_pad_layer_996", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_439_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_439_insert_1", "inbound_nodes": [[["custom_crop_layer_734", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_735", "trainable": true, "dtype": "float32", "cropping": [[1, 2], [0, 1], [2, 2]]}, "name": "custom_crop_layer_735", "inbound_nodes": [[["zero_padding2d_439_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_301_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_301_insert", "inbound_nodes": [[["custom_crop_layer_735", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_997", "trainable": true, "dtype": "float32", "padding": [[5, 6], [4, 4], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_997", "inbound_nodes": [[["depthwise_conv2d_301_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_233_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_233_insert", "inbound_nodes": [[["custom_pad_layer_997", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_998", "trainable": true, "dtype": "float32", "padding": [[0, 0], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_998", "inbound_nodes": [[["re_lu_233_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_736", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 0], [2, 3]]}, "name": "custom_crop_layer_736", "inbound_nodes": [[["custom_pad_layer_998", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5329_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5329_insert", "inbound_nodes": [[["custom_crop_layer_736", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_999", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_999", "inbound_nodes": [[["conv2d_5329_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_737", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_737", "inbound_nodes": [[["custom_pad_layer_999", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_235_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_235_insert", "inbound_nodes": [[["custom_crop_layer_737", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1000", "trainable": true, "dtype": "float32", "padding": [[6, 6], [0, 0], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_1000", "inbound_nodes": [[["re_lu_235_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_738", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_738", "inbound_nodes": [[["custom_pad_layer_1000", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_303_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_303_insert_1", "inbound_nodes": [[["custom_crop_layer_738", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1001", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_1001", "inbound_nodes": [[["depthwise_conv2d_303_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_739", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_739", "inbound_nodes": [[["custom_pad_layer_1001", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2289_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2289_insert", "inbound_nodes": [[["custom_crop_layer_739", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1002", "trainable": true, "dtype": "float32", "padding": [[4, 5], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_1002", "inbound_nodes": [[["batch_normalization_2289_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_740", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [5, 6]]}, "name": "custom_crop_layer_740", "inbound_nodes": [[["custom_pad_layer_1002", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2291_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2291_insert_1", "inbound_nodes": [[["custom_crop_layer_740", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1003", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_1003", "inbound_nodes": [[["batch_normalization_2291_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_741", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [2, 3], [0, 0]]}, "name": "custom_crop_layer_741", "inbound_nodes": [[["custom_pad_layer_1003", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_237_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_237_insert", "inbound_nodes": [[["custom_crop_layer_741", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_1004", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_1004", "inbound_nodes": [[["re_lu_237_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_742", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 1], [0, 0]]}, "name": "custom_crop_layer_742", "inbound_nodes": [[["custom_pad_layer_1004", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_239_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_239_insert", "inbound_nodes": [[["custom_crop_layer_742", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_743", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [1, 1], [5, 5]]}, "name": "custom_crop_layer_743", "inbound_nodes": [[["re_lu_239_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_303_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_303_insert_2", "inbound_nodes": [[["re_lu_231_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2293_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2293_insert", "inbound_nodes": [[["custom_crop_layer_743", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv1_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1_2", "inbound_nodes": [[["batch_normalization_2291_insert_1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_439_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_439_insert_2", "inbound_nodes": [[["re_lu_233_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1665_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1665_insert_2", "inbound_nodes": [[["re_lu_231_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_102", "trainable": true, "dtype": "float32", "cropping": [[22, 22], [22, 22]], "data_format": "channels_last"}, "name": "cropping2d_102", "inbound_nodes": [[["depthwise_conv2d_303_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2291_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2291_insert_2", "inbound_nodes": [[["depthwise_conv2d_303_insert_1", 0, 0, {}]]]}], "input_layers": [["input_991", 0, 0]], "output_layers": [["batch_normalization_2293_insert", 0, 0], ["Conv1_2", 0, 0], ["zero_padding2d_439_insert_2", 0, 0], ["global_average_pooling2d_1665_insert_2", 0, 0], ["cropping2d_102", 0, 0], ["batch_normalization_2291_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}