{"class_name": "Functional", "config": {"name": "model_7748", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_986"}, "name": "input_986", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_986", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1829_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1829_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2261_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2261_insert_merge1", "inbound_nodes": [[["max_pooling2d_1829_insert", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_59_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_59_copy_ML", "inbound_nodes": [[["batch_normalization_2261_insert_merge1", 0, 0, {}], ["max_pooling2d_1829_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_431_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_431_insert", "inbound_nodes": [[["add_59_copy_ML", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5301_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5301_insert", "inbound_nodes": [[["zero_padding2d_431_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5303_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5303_insert", "inbound_nodes": [[["conv2d_5301_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1657_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1657_insert", "inbound_nodes": [[["conv2d_5303_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1674_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1674_insert", "inbound_nodes": [[["global_average_pooling2d_1657_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1675_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1675_insert", "inbound_nodes": [[["custom_expand_layer_1674_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5305_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5305_insert", "inbound_nodes": [[["custom_expand_layer_1675_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5307_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5307_insert", "inbound_nodes": [[["conv2d_5305_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_973", "trainable": true, "dtype": "float32", "padding": [[3, 4], [5, 5], [8, 8]], "constant_values": 2}, "name": "custom_pad_layer_973", "inbound_nodes": [[["conv2d_5307_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2263_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2263_insert", "inbound_nodes": [[["custom_pad_layer_973", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_974", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_974", "inbound_nodes": [[["batch_normalization_2263_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_720", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [2, 3]]}, "name": "custom_crop_layer_720", "inbound_nodes": [[["custom_pad_layer_974", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5309_insert_1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5309_insert_1", "inbound_nodes": [[["custom_crop_layer_720", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_975", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_975", "inbound_nodes": [[["conv2d_5309_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_721", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [0, 0]]}, "name": "custom_crop_layer_721", "inbound_nodes": [[["custom_pad_layer_975", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2265_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2265_insert", "inbound_nodes": [[["custom_crop_layer_721", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_976", "trainable": true, "dtype": "float32", "padding": [[1, 2], [5, 5], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_976", "inbound_nodes": [[["batch_normalization_2265_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5311_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5311_insert", "inbound_nodes": [[["custom_pad_layer_976", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_977", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [7, 8]], "constant_values": 2}, "name": "custom_pad_layer_977", "inbound_nodes": [[["conv2d_5311_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_722", "trainable": true, "dtype": "float32", "cropping": [[5, 5], [1, 1], [0, 0]]}, "name": "custom_crop_layer_722", "inbound_nodes": [[["custom_pad_layer_977", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2267_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2267_insert", "inbound_nodes": [[["custom_crop_layer_722", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_978", "trainable": true, "dtype": "float32", "padding": [[5, 5], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_978", "inbound_nodes": [[["batch_normalization_2267_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5309_insert_2", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5309_insert_2", "inbound_nodes": [[["max_pooling2d_1829_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2269_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2269_insert_1", "inbound_nodes": [[["custom_pad_layer_978", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_101", "trainable": true, "dtype": "float32", "cropping": [[52, 52], [52, 52]], "data_format": "channels_last"}, "name": "cropping2d_101", "inbound_nodes": [[["conv2d_5309_insert_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2269_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2269_insert_2", "inbound_nodes": [[["conv2d_5309_insert_1", 0, 0, {}]]]}], "input_layers": [["input_986", 0, 0]], "output_layers": [["batch_normalization_2269_insert_1", 0, 0], ["cropping2d_101", 0, 0], ["batch_normalization_2269_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}