{"class_name": "Functional", "config": {"name": "model_3842", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_498"}, "name": "input_498", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_498", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_625_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_625_insert_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_871_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_871_insert", "inbound_nodes": [[["average_pooling2d_625_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1109_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1109_insert", "inbound_nodes": [[["max_pooling2d_871_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2583_insert_1", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2583_insert_1", "inbound_nodes": [[["batch_normalization_1109_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2585_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2585_insert", "inbound_nodes": [[["conv2d_2583_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2587_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2587_insert", "inbound_nodes": [[["conv2d_2585_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2589_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2589_insert", "inbound_nodes": [[["conv2d_2587_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2591_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2591_insert", "inbound_nodes": [[["conv2d_2589_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2593_insert_1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2593_insert_1", "inbound_nodes": [[["conv2d_2591_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_823_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_823_insert", "inbound_nodes": [[["conv2d_2593_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_844_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_844_insert", "inbound_nodes": [[["global_average_pooling2d_823_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_845_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_845_insert", "inbound_nodes": [[["custom_expand_layer_844_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2595_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2595_insert", "inbound_nodes": [[["custom_expand_layer_845_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2597_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2597_insert", "inbound_nodes": [[["conv2d_2595_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2599_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2599_insert", "inbound_nodes": [[["conv2d_2597_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_467", "trainable": true, "dtype": "float32", "padding": [[6, 7], [8, 8], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_467", "inbound_nodes": [[["conv2d_2599_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_627_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_627_insert", "inbound_nodes": [[["custom_pad_layer_467", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_346", "trainable": true, "dtype": "float32", "cropping": [[3, 3], [2, 3], [3, 3]]}, "name": "custom_crop_layer_346", "inbound_nodes": [[["average_pooling2d_627_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_873_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_873_insert", "inbound_nodes": [[["custom_crop_layer_346", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_468", "trainable": true, "dtype": "float32", "padding": [[7, 7], [5, 5], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_468", "inbound_nodes": [[["max_pooling2d_873_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1111_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1111_insert", "inbound_nodes": [[["custom_pad_layer_468", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_347", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [3, 4], [3, 3]]}, "name": "custom_crop_layer_347", "inbound_nodes": [[["batch_normalization_1111_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_629_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_629_insert", "inbound_nodes": [[["custom_crop_layer_347", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_469", "trainable": true, "dtype": "float32", "padding": [[4, 4], [2, 2], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_469", "inbound_nodes": [[["average_pooling2d_629_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_631_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_631_insert", "inbound_nodes": [[["custom_pad_layer_469", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_470", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 1], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_470", "inbound_nodes": [[["average_pooling2d_631_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_348", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_348", "inbound_nodes": [[["custom_pad_layer_470", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1113_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1113_insert_1", "inbound_nodes": [[["custom_crop_layer_348", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_349", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 1], [1, 1]]}, "name": "custom_crop_layer_349", "inbound_nodes": [[["batch_normalization_1113_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1115_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1115_insert", "inbound_nodes": [[["custom_crop_layer_349", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_471", "trainable": true, "dtype": "float32", "padding": [[0, 1], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_471", "inbound_nodes": [[["batch_normalization_1115_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_350", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_350", "inbound_nodes": [[["custom_pad_layer_471", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1117_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1117_insert", "inbound_nodes": [[["custom_crop_layer_350", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_472", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_472", "inbound_nodes": [[["batch_normalization_1117_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_351", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_351", "inbound_nodes": [[["custom_pad_layer_472", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_875_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_875_insert", "inbound_nodes": [[["custom_crop_layer_351", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_473", "trainable": true, "dtype": "float32", "padding": [[5, 6], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_473", "inbound_nodes": [[["max_pooling2d_875_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_352", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [4, 5]]}, "name": "custom_crop_layer_352", "inbound_nodes": [[["custom_pad_layer_473", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_877_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_877_insert", "inbound_nodes": [[["custom_crop_layer_352", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_474", "trainable": true, "dtype": "float32", "padding": [[0, 1], [4, 5], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_474", "inbound_nodes": [[["max_pooling2d_877_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_633_insert_merge1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_633_insert_merge1", "inbound_nodes": [[["custom_pad_layer_474", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2593_insert_2", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2593_insert_2", "inbound_nodes": [[["average_pooling2d_625_insert_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_26_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_26_copy_ML", "inbound_nodes": [[["average_pooling2d_633_insert_merge1", 0, 0, {}], ["custom_pad_layer_474", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_46", "trainable": true, "dtype": "float32", "cropping": [[69, 69], [69, 69]], "data_format": "channels_last"}, "name": "cropping2d_46", "inbound_nodes": [[["conv2d_2593_insert_2", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_625_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_625_insert_2", "inbound_nodes": [[["max_pooling2d_875_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2583_insert_2", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2583_insert_2", "inbound_nodes": [[["max_pooling2d_875_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1113_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1113_insert_2", "inbound_nodes": [[["conv2d_2597_insert", 0, 0, {}]]]}], "input_layers": [["input_498", 0, 0]], "output_layers": [["concatenate_26_copy_ML", 0, 0], ["cropping2d_46", 0, 0], ["average_pooling2d_625_insert_2", 0, 0], ["conv2d_2583_insert_2", 0, 0], ["batch_normalization_1113_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}