{"class_name": "Functional", "config": {"name": "model_3522", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_456"}, "name": "input_456", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["input_456", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_553_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_553_insert", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2325_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2325_insert", "inbound_nodes": [[["average_pooling2d_553_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_185_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_185_insert", "inbound_nodes": [[["conv2d_2325_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_70_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_70_insert_1", "inbound_nodes": [[["dropout_185_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_187_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_187_insert", "inbound_nodes": [[["flatten_70_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_776", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_776", "inbound_nodes": [[["dropout_187_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_777", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_777", "inbound_nodes": [[["custom_expand_layer_776", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_453", "trainable": true, "dtype": "float32", "padding": [[4, 5], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_453", "inbound_nodes": [[["custom_expand_layer_777", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_336", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [294, 295]]}, "name": "custom_crop_layer_336", "inbound_nodes": [[["custom_pad_layer_453", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_555_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_555_insert", "inbound_nodes": [[["custom_crop_layer_336", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_70_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_70_insert_2", "inbound_nodes": [[["average_pooling2d_555_insert", 0, 0, {}]]]}], "input_layers": [["input_456", 0, 0]], "output_layers": [["average_pooling2d_555_insert", 0, 0], ["flatten_70_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}