{"class_name": "Functional", "config": {"name": "model_3935", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_506"}, "name": "input_506", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_506", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_211_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_211_insert_1", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2629_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2629_insert", "inbound_nodes": [[["zero_padding2d_211_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_189_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_189_insert_1", "inbound_nodes": [[["conv2d_2629_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_141_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_141_insert", "inbound_nodes": [[["depthwise_conv2d_189_insert_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_191_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_191_insert", "inbound_nodes": [[["re_lu_141_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_837_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_837_insert_1", "inbound_nodes": [[["depthwise_conv2d_191_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_858_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_858_insert", "inbound_nodes": [[["global_average_pooling2d_837_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_859_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_859_insert", "inbound_nodes": [[["custom_expand_layer_858_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2631_insert_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2631_insert_1", "inbound_nodes": [[["custom_expand_layer_859_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1143_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1143_insert", "inbound_nodes": [[["conv2d_2631_insert_1", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_493", "trainable": true, "dtype": "float32", "padding": [[5, 5], [9, 9], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_493", "inbound_nodes": [[["batch_normalization_1143_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_193_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_193_insert", "inbound_nodes": [[["custom_pad_layer_493", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_494", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_494", "inbound_nodes": [[["depthwise_conv2d_193_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_363", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 1], [0, 0]]}, "name": "custom_crop_layer_363", "inbound_nodes": [[["custom_pad_layer_494", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_143_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_143_insert", "inbound_nodes": [[["custom_crop_layer_363", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_364", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [3, 4], [0, 1]]}, "name": "custom_crop_layer_364", "inbound_nodes": [[["re_lu_143_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1145_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1145_insert", "inbound_nodes": [[["custom_crop_layer_364", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_495", "trainable": true, "dtype": "float32", "padding": [[3, 4], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_495", "inbound_nodes": [[["batch_normalization_1145_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_365", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [4, 5]]}, "name": "custom_crop_layer_365", "inbound_nodes": [[["custom_pad_layer_495", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_213_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_213_insert", "inbound_nodes": [[["custom_crop_layer_365", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_496", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_496", "inbound_nodes": [[["zero_padding2d_213_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_366", "trainable": true, "dtype": "float32", "cropping": [[3, 4], [2, 3], [0, 0]]}, "name": "custom_crop_layer_366", "inbound_nodes": [[["custom_pad_layer_496", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1147_insert_1_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1147_insert_1_merge1", "inbound_nodes": [[["custom_crop_layer_366", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_27_copy_ML", "inbound_nodes": [[["batch_normalization_1147_insert_1_merge1", 0, 0, {}], ["custom_crop_layer_366", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_497", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_497", "inbound_nodes": [[["add_27_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_367", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [3, 3]]}, "name": "custom_crop_layer_367", "inbound_nodes": [[["custom_pad_layer_497", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_215_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_215_insert", "inbound_nodes": [[["custom_crop_layer_367", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_498", "trainable": true, "dtype": "float32", "padding": [[4, 4], [3, 3], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_498", "inbound_nodes": [[["zero_padding2d_215_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_145_insert_1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_145_insert_1", "inbound_nodes": [[["custom_pad_layer_498", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_368", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [0, 1], [7, 7]]}, "name": "custom_crop_layer_368", "inbound_nodes": [[["re_lu_145_insert_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_147_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_147_insert", "inbound_nodes": [[["custom_crop_layer_368", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_499", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_499", "inbound_nodes": [[["re_lu_147_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_369", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [0, 0]]}, "name": "custom_crop_layer_369", "inbound_nodes": [[["custom_pad_layer_499", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_195_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_195_insert", "inbound_nodes": [[["custom_crop_layer_369", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_500", "trainable": true, "dtype": "float32", "padding": [[5, 5], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_500", "inbound_nodes": [[["depthwise_conv2d_195_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_370", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 2]]}, "name": "custom_crop_layer_370", "inbound_nodes": [[["custom_pad_layer_500", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_149_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_149_insert", "inbound_nodes": [[["custom_crop_layer_370", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_501", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_501", "inbound_nodes": [[["re_lu_149_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_371", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 5], [0, 0]]}, "name": "custom_crop_layer_371", "inbound_nodes": [[["custom_pad_layer_501", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1149_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1149_insert", "inbound_nodes": [[["custom_crop_layer_371", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_502", "trainable": true, "dtype": "float32", "padding": [[6, 6], [1, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_502", "inbound_nodes": [[["batch_normalization_1149_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_372", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_372", "inbound_nodes": [[["custom_pad_layer_502", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2633_insert_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2633_insert_1", "inbound_nodes": [[["custom_crop_layer_372", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_503", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [7, 7]], "constant_values": 2}, "name": "custom_pad_layer_503", "inbound_nodes": [[["conv2d_2633_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_373", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 1], [0, 0]]}, "name": "custom_crop_layer_373", "inbound_nodes": [[["custom_pad_layer_503", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1151_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1151_insert", "inbound_nodes": [[["custom_crop_layer_373", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_504", "trainable": true, "dtype": "float32", "padding": [[1, 2], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_504", "inbound_nodes": [[["batch_normalization_1151_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_374", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_374", "inbound_nodes": [[["custom_pad_layer_504", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_197_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_197_insert", "inbound_nodes": [[["custom_crop_layer_374", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_505", "trainable": true, "dtype": "float32", "padding": [[1, 2], [4, 5], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_505", "inbound_nodes": [[["depthwise_conv2d_197_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_375", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 1]]}, "name": "custom_crop_layer_375", "inbound_nodes": [[["custom_pad_layer_505", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_217_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_217_insert", "inbound_nodes": [[["custom_crop_layer_375", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_506", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_506", "inbound_nodes": [[["zero_padding2d_217_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_376", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [1, 1]]}, "name": "custom_crop_layer_376", "inbound_nodes": [[["custom_pad_layer_506", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2635_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2635_insert", "inbound_nodes": [[["custom_crop_layer_376", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_507", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_507", "inbound_nodes": [[["conv2d_2635_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_377", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_377", "inbound_nodes": [[["custom_pad_layer_507", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_189_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_189_insert_2", "inbound_nodes": [[["zero_padding2d_211_insert_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_145_insert_2", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_145_insert_2", "inbound_nodes": [[["batch_normalization_1149_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_199_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_199_insert", "inbound_nodes": [[["custom_crop_layer_377", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1147_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1147_insert_2", "inbound_nodes": [[["depthwise_conv2d_197_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2631_insert_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2631_insert_2", "inbound_nodes": [[["re_lu_149_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_211_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_211_insert_2", "inbound_nodes": [[["re_lu_143_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_49", "trainable": true, "dtype": "float32", "cropping": [[51, 51], [51, 51]], "data_format": "channels_last"}, "name": "cropping2d_49", "inbound_nodes": [[["depthwise_conv2d_189_insert_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2633_insert_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2633_insert_2", "inbound_nodes": [[["batch_normalization_1145_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_837_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_837_insert_2", "inbound_nodes": [[["re_lu_145_insert_2", 0, 0, {}]]]}], "input_layers": [["input_506", 0, 0]], "output_layers": [["depthwise_conv2d_199_insert", 0, 0], ["batch_normalization_1147_insert_2", 0, 0], ["conv2d_2631_insert_2", 0, 0], ["zero_padding2d_211_insert_2", 0, 0], ["cropping2d_49", 0, 0], ["conv2d_2633_insert_2", 0, 0], ["global_average_pooling2d_837_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}