{"class_name": "Functional", "config": {"name": "model_5216", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_656"}, "name": "input_656", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_656", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1203_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1203_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1525_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1525_insert", "inbound_nodes": [[["max_pooling2d_1203_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1205_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1205_insert", "inbound_nodes": [[["batch_normalization_1525_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_90_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_90_insert_1", "inbound_nodes": [[["max_pooling2d_1205_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_255_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_255_insert", "inbound_nodes": [[["flatten_90_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1134_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1134_insert", "inbound_nodes": [[["dropout_255_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1135_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1135_insert", "inbound_nodes": [[["custom_expand_layer_1134_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3471_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3471_insert", "inbound_nodes": [[["custom_expand_layer_1135_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3473_insert_1", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3473_insert_1", "inbound_nodes": [[["conv2d_3471_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_687", "trainable": true, "dtype": "float32", "padding": [[8, 8], [6, 7], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_687", "inbound_nodes": [[["conv2d_3473_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1527_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1527_insert", "inbound_nodes": [[["custom_pad_layer_687", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_688", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [5, 6]], "constant_values": 2}, "name": "custom_pad_layer_688", "inbound_nodes": [[["batch_normalization_1527_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_515", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [1, 2], [0, 0]]}, "name": "custom_crop_layer_515", "inbound_nodes": [[["custom_pad_layer_688", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3475_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3475_insert", "inbound_nodes": [[["custom_crop_layer_515", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_689", "trainable": true, "dtype": "float32", "padding": [[6, 6], [2, 2], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_689", "inbound_nodes": [[["conv2d_3475_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1529_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1529_insert", "inbound_nodes": [[["custom_pad_layer_689", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_516", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [2, 3], [0, 1]]}, "name": "custom_crop_layer_516", "inbound_nodes": [[["batch_normalization_1529_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1207_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1207_insert", "inbound_nodes": [[["custom_crop_layer_516", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3473_insert_2", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3473_insert_2", "inbound_nodes": [[["batch_normalization_1525_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_90_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_90_insert_2", "inbound_nodes": [[["batch_normalization_1529_insert", 0, 0, {}]]]}], "input_layers": [["input_656", 0, 0]], "output_layers": [["max_pooling2d_1207_insert", 0, 0], ["conv2d_3473_insert_2", 0, 0], ["flatten_90_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}