{"class_name": "Functional", "config": {"name": "model_5240", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_660"}, "name": "input_660", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 6, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["input_660", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_847_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_847_insert", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3479_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3479_insert", "inbound_nodes": [[["average_pooling2d_847_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_265_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_265_insert", "inbound_nodes": [[["conv2d_3479_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_93_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_93_insert_1", "inbound_nodes": [[["dropout_265_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_267_insert", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": 7}, "name": "dropout_267_insert", "inbound_nodes": [[["flatten_93_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1143", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1143", "inbound_nodes": [[["dropout_267_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1144", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1144", "inbound_nodes": [[["custom_expand_layer_1143", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_691", "trainable": true, "dtype": "float32", "padding": [[7, 7], [4, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_691", "inbound_nodes": [[["custom_expand_layer_1144", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_517", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [396, 396]]}, "name": "custom_crop_layer_517", "inbound_nodes": [[["custom_pad_layer_691", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_849_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "average_pooling2d_849_insert", "inbound_nodes": [[["custom_crop_layer_517", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_93_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_93_insert_2", "inbound_nodes": [[["average_pooling2d_849_insert", 0, 0, {}]]]}], "input_layers": [["input_660", 0, 0]], "output_layers": [["average_pooling2d_849_insert", 0, 0], ["flatten_93_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}