{"class_name": "Functional", "config": {"name": "model_2533", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_322"}, "name": "input_322", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_322", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_107_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_107_insert", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_135_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_135_insert", "inbound_nodes": [[["re_lu_107_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1691_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1691_insert", "inbound_nodes": [[["zero_padding2d_135_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_149_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_149_insert", "inbound_nodes": [[["conv2d_1691_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_739_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_739_insert", "inbound_nodes": [[["depthwise_conv2d_149_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_547_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_547_insert_1", "inbound_nodes": [[["batch_normalization_739_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_547_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_547_insert", "inbound_nodes": [[["global_average_pooling2d_547_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_548_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_548_insert", "inbound_nodes": [[["custom_expand_layer_547_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_151_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_151_insert_1", "inbound_nodes": [[["custom_expand_layer_548_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1693_insert_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1693_insert_1", "inbound_nodes": [[["depthwise_conv2d_151_insert_1", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_316", "trainable": true, "dtype": "float32", "padding": [[9, 9], [3, 3], [7, 8]], "constant_values": 2}, "name": "custom_pad_layer_316", "inbound_nodes": [[["conv2d_1693_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1695_insert_1", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1695_insert_1", "inbound_nodes": [[["custom_pad_layer_316", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_317", "trainable": true, "dtype": "float32", "padding": [[0, 0], [5, 6], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_317", "inbound_nodes": [[["conv2d_1695_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_229", "trainable": true, "dtype": "float32", "cropping": [[6, 6], [0, 0], [0, 0]]}, "name": "custom_crop_layer_229", "inbound_nodes": [[["custom_pad_layer_317", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1697_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1697_insert", "inbound_nodes": [[["custom_crop_layer_229", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_318", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [7, 8]], "constant_values": 2}, "name": "custom_pad_layer_318", "inbound_nodes": [[["conv2d_1697_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_230", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [0, 0]]}, "name": "custom_crop_layer_230", "inbound_nodes": [[["custom_pad_layer_318", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_109_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_109_insert", "inbound_nodes": [[["custom_crop_layer_230", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_231", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 1], [2, 2]]}, "name": "custom_crop_layer_231", "inbound_nodes": [[["re_lu_109_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_111_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_111_insert", "inbound_nodes": [[["custom_crop_layer_231", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_319", "trainable": true, "dtype": "float32", "padding": [[3, 4], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_319", "inbound_nodes": [[["re_lu_111_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_232", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [4, 4]]}, "name": "custom_crop_layer_232", "inbound_nodes": [[["custom_pad_layer_319", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_153_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_153_insert", "inbound_nodes": [[["custom_crop_layer_232", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_320", "trainable": true, "dtype": "float32", "padding": [[0, 1], [4, 4], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_320", "inbound_nodes": [[["depthwise_conv2d_153_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_137_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_137_insert", "inbound_nodes": [[["custom_pad_layer_320", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_233", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 3], [1, 2]]}, "name": "custom_crop_layer_233", "inbound_nodes": [[["zero_padding2d_137_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_741_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_741_insert", "inbound_nodes": [[["custom_crop_layer_233", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_321", "trainable": true, "dtype": "float32", "padding": [[3, 3], [6, 6], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_321", "inbound_nodes": [[["batch_normalization_741_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_155_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_155_insert", "inbound_nodes": [[["custom_pad_layer_321", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_322", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 4], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_322", "inbound_nodes": [[["depthwise_conv2d_155_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_234", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [0, 1]]}, "name": "custom_crop_layer_234", "inbound_nodes": [[["custom_pad_layer_322", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_113_insert_1_merge1", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_113_insert_1_merge1", "inbound_nodes": [[["custom_crop_layer_234", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_16_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_16_copy_ML", "inbound_nodes": [[["re_lu_113_insert_1_merge1", 0, 0, {}], ["custom_crop_layer_234", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_323", "trainable": true, "dtype": "float32", "padding": [[1, 2], [2, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_323", "inbound_nodes": [[["add_16_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_235", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 1]]}, "name": "custom_crop_layer_235", "inbound_nodes": [[["custom_pad_layer_323", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_115_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_115_insert", "inbound_nodes": [[["custom_crop_layer_235", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_236", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 1], [0, 1]]}, "name": "custom_crop_layer_236", "inbound_nodes": [[["re_lu_115_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_743_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_743_insert_1", "inbound_nodes": [[["custom_crop_layer_236", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_324", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_324", "inbound_nodes": [[["batch_normalization_743_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_237", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [2, 2], [0, 0]]}, "name": "custom_crop_layer_237", "inbound_nodes": [[["custom_pad_layer_324", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_139_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_139_insert", "inbound_nodes": [[["custom_crop_layer_237", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_238", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [4, 5], [3, 3]]}, "name": "custom_crop_layer_238", "inbound_nodes": [[["zero_padding2d_139_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_745_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_745_insert", "inbound_nodes": [[["custom_crop_layer_238", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_239", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 1], [0, 0]]}, "name": "custom_crop_layer_239", "inbound_nodes": [[["batch_normalization_745_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_157_insert_1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_157_insert_1", "inbound_nodes": [[["custom_crop_layer_239", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_325", "trainable": true, "dtype": "float32", "padding": [[3, 4], [5, 6], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_325", "inbound_nodes": [[["depthwise_conv2d_157_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_240", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 2]]}, "name": "custom_crop_layer_240", "inbound_nodes": [[["custom_pad_layer_325", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_141_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_141_insert", "inbound_nodes": [[["custom_crop_layer_240", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_326", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_326", "inbound_nodes": [[["zero_padding2d_141_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_241", "trainable": true, "dtype": "float32", "cropping": [[2, 3], [0, 0], [0, 0]]}, "name": "custom_crop_layer_241", "inbound_nodes": [[["custom_pad_layer_326", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_747_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_747_insert", "inbound_nodes": [[["custom_crop_layer_241", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_157_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_157_insert_2", "inbound_nodes": [[["zero_padding2d_135_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1693_insert_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1693_insert_2", "inbound_nodes": [[["batch_normalization_747_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_113_insert_2", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_113_insert_2", "inbound_nodes": [[["batch_normalization_739_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_31", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_31", "inbound_nodes": [[["depthwise_conv2d_157_insert_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1695_insert_2", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1695_insert_2", "inbound_nodes": [[["re_lu_109_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_151_insert_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_151_insert_2", "inbound_nodes": [[["re_lu_111_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_743_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_743_insert_2", "inbound_nodes": [[["conv2d_1693_insert_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_32", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_32", "inbound_nodes": [[["re_lu_113_insert_2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_547_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_547_insert_2", "inbound_nodes": [[["re_lu_107_insert", 0, 0, {}]]]}], "input_layers": [["input_322", 0, 0]], "output_layers": [["cropping2d_31", 0, 0], ["conv2d_1695_insert_2", 0, 0], ["depthwise_conv2d_151_insert_2", 0, 0], ["batch_normalization_743_insert_2", 0, 0], ["cropping2d_32", 0, 0], ["global_average_pooling2d_547_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}