{"class_name": "Functional", "config": {"name": "model_2470", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_318"}, "name": "input_318", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_318", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_553_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_553_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1673_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1673_insert", "inbound_nodes": [[["max_pooling2d_553_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1675_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1675_insert", "inbound_nodes": [[["conv2d_1673_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_717_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_717_insert", "inbound_nodes": [[["conv2d_1675_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_541_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_541_insert", "inbound_nodes": [[["batch_normalization_717_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_543_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_543_insert", "inbound_nodes": [[["global_average_pooling2d_541_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_544_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_544_insert", "inbound_nodes": [[["custom_expand_layer_543_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1677_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1677_insert", "inbound_nodes": [[["custom_expand_layer_544_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_133_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_133_insert", "inbound_nodes": [[["conv2d_1677_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1679_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1679_insert", "inbound_nodes": [[["zero_padding2d_133_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_298", "trainable": true, "dtype": "float32", "padding": [[4, 5], [2, 3], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_298", "inbound_nodes": [[["conv2d_1679_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1681_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1681_insert", "inbound_nodes": [[["custom_pad_layer_298", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_299", "trainable": true, "dtype": "float32", "padding": [[0, 1], [6, 7], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_299", "inbound_nodes": [[["conv2d_1681_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_216", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [1, 1]]}, "name": "custom_crop_layer_216", "inbound_nodes": [[["custom_pad_layer_299", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_719_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_719_insert_merge1", "inbound_nodes": [[["custom_crop_layer_216", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_14_copy_ML", "inbound_nodes": [[["batch_normalization_719_insert_merge1", 0, 0, {}], ["custom_crop_layer_216", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_300", "trainable": true, "dtype": "float32", "padding": [[5, 5], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_300", "inbound_nodes": [[["add_14_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_217", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [0, 0]]}, "name": "custom_crop_layer_217", "inbound_nodes": [[["custom_pad_layer_300", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_721_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_721_insert", "inbound_nodes": [[["custom_crop_layer_217", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_301", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [6, 7]], "constant_values": 2}, "name": "custom_pad_layer_301", "inbound_nodes": [[["batch_normalization_721_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_218", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [0, 0]]}, "name": "custom_crop_layer_218", "inbound_nodes": [[["custom_pad_layer_301", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_723_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_723_insert", "inbound_nodes": [[["custom_crop_layer_218", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_302", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_302", "inbound_nodes": [[["batch_normalization_723_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_219", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [6, 7], [2, 2]]}, "name": "custom_crop_layer_219", "inbound_nodes": [[["custom_pad_layer_302", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_725_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_725_insert", "inbound_nodes": [[["custom_crop_layer_219", 0, 0, {}]]]}], "input_layers": [["input_318", 0, 0]], "output_layers": [["batch_normalization_725_insert", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}