{"class_name": "Functional", "config": {"name": "model_938", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_121"}, "name": "input_121", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_121", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_257_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_257_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_175_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_175_insert", "inbound_nodes": [[["batch_normalization_257_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_693_insert", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_693_insert", "inbound_nodes": [[["average_pooling2d_175_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_241_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_241_insert", "inbound_nodes": [[["conv2d_693_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_695_insert", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_695_insert", "inbound_nodes": [[["max_pooling2d_241_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_697_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_697_insert", "inbound_nodes": [[["conv2d_695_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_699_insert", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_699_insert", "inbound_nodes": [[["conv2d_697_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_701_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_701_insert", "inbound_nodes": [[["conv2d_699_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_703_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_703_insert", "inbound_nodes": [[["conv2d_701_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_201_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_201_insert", "inbound_nodes": [[["conv2d_703_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_208_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_208_insert", "inbound_nodes": [[["global_average_pooling2d_201_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_209_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_209_insert", "inbound_nodes": [[["custom_expand_layer_208_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_705_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_705_insert", "inbound_nodes": [[["custom_expand_layer_209_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_707_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [7, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_707_insert", "inbound_nodes": [[["conv2d_705_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_709_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_709_insert", "inbound_nodes": [[["conv2d_707_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_78", "trainable": true, "dtype": "float32", "padding": [[3, 3], [4, 5], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_78", "inbound_nodes": [[["conv2d_709_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_259_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_259_insert", "inbound_nodes": [[["custom_pad_layer_78", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_79", "trainable": true, "dtype": "float32", "padding": [[6, 6], [3, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_79", "inbound_nodes": [[["batch_normalization_259_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_61", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [2, 3]]}, "name": "custom_crop_layer_61", "inbound_nodes": [[["custom_pad_layer_79", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_243_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_243_insert", "inbound_nodes": [[["custom_crop_layer_61", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_80", "trainable": true, "dtype": "float32", "padding": [[2, 3], [4, 5], [3, 4]], "constant_values": 2}, "name": "custom_pad_layer_80", "inbound_nodes": [[["max_pooling2d_243_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_261_insert_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_261_insert_merge1", "inbound_nodes": [[["custom_pad_layer_80", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_7_copy_ML", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_7_copy_ML", "inbound_nodes": [[["batch_normalization_261_insert_merge1", 0, 0, {}], ["custom_pad_layer_80", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_81", "trainable": true, "dtype": "float32", "padding": [[0, 0], [1, 2], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_81", "inbound_nodes": [[["concatenate_7_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_62", "trainable": true, "dtype": "float32", "cropping": [[4, 5], [0, 0], [3, 4]]}, "name": "custom_crop_layer_62", "inbound_nodes": [[["custom_pad_layer_81", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_263_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_263_insert", "inbound_nodes": [[["custom_crop_layer_62", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_82", "trainable": true, "dtype": "float32", "padding": [[2, 3], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_82", "inbound_nodes": [[["batch_normalization_263_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_63", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [0, 0]]}, "name": "custom_crop_layer_63", "inbound_nodes": [[["custom_pad_layer_82", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_265_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_265_insert", "inbound_nodes": [[["custom_crop_layer_63", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_64", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [1, 1], [4, 5]]}, "name": "custom_crop_layer_64", "inbound_nodes": [[["batch_normalization_265_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_245_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_245_insert", "inbound_nodes": [[["custom_crop_layer_64", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_83", "trainable": true, "dtype": "float32", "padding": [[1, 2], [3, 3], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_83", "inbound_nodes": [[["max_pooling2d_245_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_247_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_247_insert", "inbound_nodes": [[["custom_pad_layer_83", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_84", "trainable": true, "dtype": "float32", "padding": [[8, 8], [7, 8], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_84", "inbound_nodes": [[["max_pooling2d_247_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_177_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_177_insert", "inbound_nodes": [[["custom_pad_layer_84", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_65", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [4, 5], [3, 3]]}, "name": "custom_crop_layer_65", "inbound_nodes": [[["average_pooling2d_177_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_179_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_179_insert", "inbound_nodes": [[["custom_crop_layer_65", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_85", "trainable": true, "dtype": "float32", "padding": [[1, 2], [2, 3], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_85", "inbound_nodes": [[["average_pooling2d_179_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_181_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_181_insert", "inbound_nodes": [[["custom_pad_layer_85", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_66", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 4], [2, 2]]}, "name": "custom_crop_layer_66", "inbound_nodes": [[["average_pooling2d_181_insert", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_183_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_183_insert_1", "inbound_nodes": [[["custom_crop_layer_66", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_183_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_183_insert_2", "inbound_nodes": [[["max_pooling2d_245_insert", 0, 0, {}]]]}], "input_layers": [["input_121", 0, 0]], "output_layers": [["average_pooling2d_183_insert_1", 0, 0], ["average_pooling2d_183_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}