{"class_name": "Functional", "config": {"name": "model_306", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_33"}, "name": "input_33", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, 49, 1], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "shared_object_id": 1}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 2}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 3}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "name": "lstm_1", "inbound_nodes": [[["input_33", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_3_insert_1", "trainable": true, "batch_input_shape": [null, null, null], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 7, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "shared_object_id": 6}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 7}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 8}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "name": "lstm_3_insert_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_29_insert", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "dropout_29_insert", "inbound_nodes": [[["lstm_3_insert_1", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_64", "trainable": true, "dtype": "float32", "padding": [[2, 3]], "constant_values": 2}, "name": "custom_pad_layer_64", "inbound_nodes": [[["dropout_29_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_31_insert", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "dropout_31_insert", "inbound_nodes": [[["custom_pad_layer_64", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_51", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_51", "inbound_nodes": [[["dropout_31_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_33_insert", "trainable": true, "dtype": "float32", "rate": 0.05, "noise_shape": null, "seed": null}, "name": "dropout_33_insert", "inbound_nodes": [[["custom_expand_layer_51", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_3_insert_2", "trainable": true, "batch_input_shape": [null, null, null], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 7, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "shared_object_id": 16}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 17}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 18}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "name": "lstm_3_insert_2", "inbound_nodes": [[["dropout_33_insert", 0, 0, {}]]]}], "input_layers": [["input_33", 0, 0]], "output_layers": [["dropout_33_insert", 0, 0], ["lstm_3_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}