{"class_name": "Functional", "config": {"name": "model_6166", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_792"}, "name": "input_792", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["input_792", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1447_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1447_insert", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_287_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_287_insert", "inbound_nodes": [[["max_pooling2d_1447_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1793_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1793_insert_1", "inbound_nodes": [[["dropout_287_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4219_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4219_insert", "inbound_nodes": [[["batch_normalization_1793_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4221_insert", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4221_insert", "inbound_nodes": [[["conv2d_4219_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1449_insert", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1449_insert", "inbound_nodes": [[["conv2d_4221_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_106_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_106_insert_1", "inbound_nodes": [[["max_pooling2d_1449_insert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_289_insert", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_289_insert", "inbound_nodes": [[["flatten_106_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1355", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1355", "inbound_nodes": [[["dropout_289_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1356", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1356", "inbound_nodes": [[["custom_expand_layer_1355", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_747", "trainable": true, "dtype": "float32", "padding": [[4, 4], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_747", "inbound_nodes": [[["custom_expand_layer_1356", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_560", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [9, 9]]}, "name": "custom_crop_layer_560", "inbound_nodes": [[["custom_pad_layer_747", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1795_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1795_insert", "inbound_nodes": [[["custom_crop_layer_560", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_748", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_748", "inbound_nodes": [[["batch_normalization_1795_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_561", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [0, 0], [3, 3]]}, "name": "custom_crop_layer_561", "inbound_nodes": [[["custom_pad_layer_748", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1451_insert", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1451_insert", "inbound_nodes": [[["custom_crop_layer_561", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_749", "trainable": true, "dtype": "float32", "padding": [[5, 6], [5, 5], [3, 3]], "constant_values": 2}, "name": "custom_pad_layer_749", "inbound_nodes": [[["max_pooling2d_1451_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1797_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1797_insert", "inbound_nodes": [[["custom_pad_layer_749", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_750", "trainable": true, "dtype": "float32", "padding": [[2, 2], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_750", "inbound_nodes": [[["batch_normalization_1797_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_562", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [0, 0]]}, "name": "custom_crop_layer_562", "inbound_nodes": [[["custom_pad_layer_750", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4223_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4223_insert", "inbound_nodes": [[["custom_crop_layer_562", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1793_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1793_insert_2", "inbound_nodes": [[["max_pooling2d_1451_insert", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_106_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_106_insert_2", "inbound_nodes": [[["batch_normalization_1797_insert", 0, 0, {}]]]}], "input_layers": [["input_792", 0, 0]], "output_layers": [["conv2d_4223_insert", 0, 0], ["batch_normalization_1793_insert_2", 0, 0], ["flatten_106_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}