{"class_name": "Functional", "config": {"name": "model_6544", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_835"}, "name": "input_835", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_835", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1905_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1905_insert", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_197_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_197_insert", "inbound_nodes": [[["batch_normalization_1905_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_255_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_255_insert", "inbound_nodes": [[["re_lu_197_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4495_insert", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4495_insert", "inbound_nodes": [[["depthwise_conv2d_255_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4497_insert_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4497_insert_1", "inbound_nodes": [[["conv2d_4495_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1401_insert_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1401_insert_1", "inbound_nodes": [[["conv2d_4497_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1423_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1423_insert", "inbound_nodes": [[["global_average_pooling2d_1401_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1424_insert", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1424_insert", "inbound_nodes": [[["custom_expand_layer_1423_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_357_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_357_insert", "inbound_nodes": [[["custom_expand_layer_1424_insert", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_257_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_257_insert", "inbound_nodes": [[["zero_padding2d_357_insert", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_796", "trainable": true, "dtype": "float32", "padding": [[3, 4], [8, 8], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_796", "inbound_nodes": [[["depthwise_conv2d_257_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1907_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1907_insert", "inbound_nodes": [[["custom_pad_layer_796", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_797", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_797", "inbound_nodes": [[["batch_normalization_1907_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_592", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [5, 5], [0, 0]]}, "name": "custom_crop_layer_592", "inbound_nodes": [[["custom_pad_layer_797", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_199_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_199_insert", "inbound_nodes": [[["custom_crop_layer_592", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_798", "trainable": true, "dtype": "float32", "padding": [[1, 1], [3, 3], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_798", "inbound_nodes": [[["re_lu_199_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_201_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_201_insert", "inbound_nodes": [[["custom_pad_layer_798", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_799", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [1, 2]], "constant_values": 2}, "name": "custom_pad_layer_799", "inbound_nodes": [[["re_lu_201_insert", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_203_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_203_insert", "inbound_nodes": [[["custom_pad_layer_799", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_800", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_800", "inbound_nodes": [[["re_lu_203_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_593", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 0], [3, 3]]}, "name": "custom_crop_layer_593", "inbound_nodes": [[["custom_pad_layer_800", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_259_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_259_insert", "inbound_nodes": [[["custom_crop_layer_593", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_801", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 1], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_801", "inbound_nodes": [[["depthwise_conv2d_259_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_594", "trainable": true, "dtype": "float32", "cropping": [[5, 6], [0, 0], [0, 0]]}, "name": "custom_crop_layer_594", "inbound_nodes": [[["custom_pad_layer_801", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1909_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1909_insert_1", "inbound_nodes": [[["custom_crop_layer_594", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_802", "trainable": true, "dtype": "float32", "padding": [[5, 6], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_802", "inbound_nodes": [[["batch_normalization_1909_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_595", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 0]]}, "name": "custom_crop_layer_595", "inbound_nodes": [[["custom_pad_layer_802", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1911_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1911_insert", "inbound_nodes": [[["custom_crop_layer_595", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_803", "trainable": true, "dtype": "float32", "padding": [[1, 2], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_803", "inbound_nodes": [[["batch_normalization_1911_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_596", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 1], [2, 3]]}, "name": "custom_crop_layer_596", "inbound_nodes": [[["custom_pad_layer_803", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_261_insert_merge1", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_261_insert_merge1", "inbound_nodes": [[["custom_crop_layer_596", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_51_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_51_copy_ML", "inbound_nodes": [[["depthwise_conv2d_261_insert_merge1", 0, 0, {}], ["custom_crop_layer_596", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_804", "trainable": true, "dtype": "float32", "padding": [[0, 0], [6, 7], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_804", "inbound_nodes": [[["add_51_copy_ML", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_597", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [0, 1]]}, "name": "custom_crop_layer_597", "inbound_nodes": [[["custom_pad_layer_804", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_205_insert", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_205_insert", "inbound_nodes": [[["custom_crop_layer_597", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_805", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_805", "inbound_nodes": [[["re_lu_205_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_598", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [5, 6], [0, 0]]}, "name": "custom_crop_layer_598", "inbound_nodes": [[["custom_pad_layer_805", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4499_insert", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4499_insert", "inbound_nodes": [[["custom_crop_layer_598", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_806", "trainable": true, "dtype": "float32", "padding": [[3, 3], [0, 0], [5, 5]], "constant_values": 2}, "name": "custom_pad_layer_806", "inbound_nodes": [[["conv2d_4499_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_599", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [1, 2], [0, 0]]}, "name": "custom_crop_layer_599", "inbound_nodes": [[["custom_pad_layer_806", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_263_insert", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_263_insert", "inbound_nodes": [[["custom_crop_layer_599", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_807", "trainable": true, "dtype": "float32", "padding": [[0, 0], [7, 7], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_807", "inbound_nodes": [[["depthwise_conv2d_263_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_600", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [2, 3]]}, "name": "custom_crop_layer_600", "inbound_nodes": [[["custom_pad_layer_807", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_359_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_359_insert", "inbound_nodes": [[["custom_crop_layer_600", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_808", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 5]], "constant_values": 2}, "name": "custom_pad_layer_808", "inbound_nodes": [[["zero_padding2d_359_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_601", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [3, 4], [0, 0]]}, "name": "custom_crop_layer_601", "inbound_nodes": [[["custom_pad_layer_808", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1913_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1913_insert", "inbound_nodes": [[["custom_crop_layer_601", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_809", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_809", "inbound_nodes": [[["batch_normalization_1913_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_602", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [0, 1], [6, 6]]}, "name": "custom_crop_layer_602", "inbound_nodes": [[["custom_pad_layer_809", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_361_insert", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_361_insert", "inbound_nodes": [[["custom_crop_layer_602", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_810", "trainable": true, "dtype": "float32", "padding": [[0, 0], [0, 0], [4, 4]], "constant_values": 2}, "name": "custom_pad_layer_810", "inbound_nodes": [[["zero_padding2d_361_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_603", "trainable": true, "dtype": "float32", "cropping": [[0, 1], [2, 2], [0, 0]]}, "name": "custom_crop_layer_603", "inbound_nodes": [[["custom_pad_layer_810", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_363_insert_1", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_363_insert_1", "inbound_nodes": [[["custom_crop_layer_603", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_811", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 3], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_811", "inbound_nodes": [[["zero_padding2d_363_insert_1", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_604", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 0], [1, 2]]}, "name": "custom_crop_layer_604", "inbound_nodes": [[["custom_pad_layer_811", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4497_insert_2_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4497_insert_2_2", "inbound_nodes": [[["batch_normalization_1905_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4501_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4501_insert", "inbound_nodes": [[["custom_crop_layer_604", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4497_insert_2_1", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4497_insert_2_1", "inbound_nodes": [[["re_lu_199_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1401_insert_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1401_insert_2", "inbound_nodes": [[["re_lu_203_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1909_insert_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1909_insert_2", "inbound_nodes": [[["depthwise_conv2d_263_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_78", "trainable": true, "dtype": "float32", "cropping": [[51, 51], [51, 51]], "data_format": "channels_last"}, "name": "cropping2d_78", "inbound_nodes": [[["conv2d_4497_insert_2_2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_363_insert_2", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_363_insert_2", "inbound_nodes": [[["re_lu_199_insert", 0, 0, {}]]]}], "input_layers": [["input_835", 0, 0]], "output_layers": [["conv2d_4501_insert", 0, 0], ["conv2d_4497_insert_2_1", 0, 0], ["global_average_pooling2d_1401_insert_2", 0, 0], ["batch_normalization_1909_insert_2", 0, 0], ["cropping2d_78", 0, 0], ["zero_padding2d_363_insert_2", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}