{"class_name": "Functional", "config": {"name": "model_6487", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_832"}, "name": "input_832", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "conv1_pad", "inbound_nodes": [[["input_832", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1885_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1885_insert", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4477_insert", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4477_insert", "inbound_nodes": [[["batch_normalization_1885_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1525_insert_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1525_insert_1", "inbound_nodes": [[["conv2d_4477_insert", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_355_insert", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_355_insert", "inbound_nodes": [[["max_pooling2d_1525_insert_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4479_insert", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4479_insert", "inbound_nodes": [[["zero_padding2d_355_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4481_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4481_insert", "inbound_nodes": [[["conv2d_4479_insert", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4483_insert_1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4483_insert_1", "inbound_nodes": [[["conv2d_4481_insert", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1397_insert", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d_1397_insert", "inbound_nodes": [[["conv2d_4483_insert_1", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1419", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1419", "inbound_nodes": [[["global_average_pooling2d_1397_insert", 0, 0, {}]]]}, {"class_name": "CustomExpandLayer", "config": {"name": "custom_expand_layer_1420", "trainable": true, "dtype": "float32", "axis": 1}, "name": "custom_expand_layer_1420", "inbound_nodes": [[["custom_expand_layer_1419", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_779", "trainable": true, "dtype": "float32", "padding": [[8, 8], [5, 6], [1, 1]], "constant_values": 2}, "name": "custom_pad_layer_779", "inbound_nodes": [[["custom_expand_layer_1420", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1887_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1887_insert", "inbound_nodes": [[["custom_pad_layer_779", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_780", "trainable": true, "dtype": "float32", "padding": [[0, 0], [2, 2], [2, 2]], "constant_values": 2}, "name": "custom_pad_layer_780", "inbound_nodes": [[["batch_normalization_1887_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_583", "trainable": true, "dtype": "float32", "cropping": [[2, 2], [0, 0], [0, 0]]}, "name": "custom_crop_layer_583", "inbound_nodes": [[["custom_pad_layer_780", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4485_insert", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4485_insert", "inbound_nodes": [[["custom_crop_layer_583", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_781", "trainable": true, "dtype": "float32", "padding": [[5, 6], [1, 1], [2, 3]], "constant_values": 2}, "name": "custom_pad_layer_781", "inbound_nodes": [[["conv2d_4485_insert", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1889_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1889_insert", "inbound_nodes": [[["custom_pad_layer_781", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_782", "trainable": true, "dtype": "float32", "padding": [[0, 0], [6, 6], [0, 1]], "constant_values": 2}, "name": "custom_pad_layer_782", "inbound_nodes": [[["batch_normalization_1889_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_584", "trainable": true, "dtype": "float32", "cropping": [[4, 4], [0, 0], [0, 0]]}, "name": "custom_crop_layer_584", "inbound_nodes": [[["custom_pad_layer_782", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1891_insert", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1891_insert", "inbound_nodes": [[["custom_crop_layer_584", 0, 0, {}]]]}, {"class_name": "CustomPadLayer", "config": {"name": "custom_pad_layer_783", "trainable": true, "dtype": "float32", "padding": [[1, 1], [0, 0], [0, 0]], "constant_values": 2}, "name": "custom_pad_layer_783", "inbound_nodes": [[["batch_normalization_1891_insert", 0, 0, {}]]]}, {"class_name": "CustomCropLayer", "config": {"name": "custom_crop_layer_585", "trainable": true, "dtype": "float32", "cropping": [[0, 0], [4, 5], [2, 3]]}, "name": "custom_crop_layer_585", "inbound_nodes": [[["custom_pad_layer_783", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4483_insert_2", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4483_insert_2", "inbound_nodes": [[["max_pooling2d_1525_insert_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1893_insert_2_merge1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1893_insert_2_merge1", "inbound_nodes": [[["conv2d_4485_insert", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1525_insert_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1525_insert_2", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1893_insert_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1893_insert_1", "inbound_nodes": [[["custom_crop_layer_585", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_76", "trainable": true, "dtype": "float32", "cropping": [[23, 23], [23, 23]], "data_format": "channels_last"}, "name": "cropping2d_76", "inbound_nodes": [[["conv2d_4483_insert_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_48_copy_ML", "trainable": true, "dtype": "float32"}, "name": "add_48_copy_ML", "inbound_nodes": [[["batch_normalization_1893_insert_2_merge1", 0, 0, {}], ["conv2d_4485_insert", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_77", "trainable": true, "dtype": "float32", "cropping": [[52, 52], [52, 52]], "data_format": "channels_last"}, "name": "cropping2d_77", "inbound_nodes": [[["max_pooling2d_1525_insert_2", 0, 0, {}]]]}], "input_layers": [["input_832", 0, 0]], "output_layers": [["batch_normalization_1893_insert_1", 0, 0], ["cropping2d_76", 0, 0], ["add_48_copy_ML", 0, 0], ["cropping2d_77", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}